[
  {
    "Product_URL": "https://www.lk-ea.com/products/medium-voltage/air-insulated-switchgear-ais/vh3h",
    "Brand": "Lauritz Knudsen",
    "Type": "MEDIUM VOLTAGE",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "VH3H",
    "Product_Type": "Air Insulated Switchgear - Ais",
    "Full_Description": "Our Air Insulated Switchgear offers unparalleled performance up to 36 kV and 50kA, along with a 3-second short circuit withstand capacity, ensuring reliability under intense conditions. With a Loss of Service Continuity-2B rating and IP4X protection, it guarantees uninterrupted operation even in challenging environments. Enhanced with additional customized safety interlocks, this switchgear prioritizes safety without compromising efficiency, demonstrated by its ability to handle numerous operating cycles and maintain optimal performance through efficient 10,000 switching operations. Leveraging our esteemed and validated designs, we've seamlessly integrated cutting-edge connected capabilities, including embedded arc flash protection and health monitoring sensors. At Lauritz Knudsen Electrical & Automation, we believe these advancements empower you to not only optimize the longevity and efficiency of your switchboard but also ensure utmost safety and reliability in your operations.",
    "Short_Description": "Experience the efficiency and flexibility of VH3H for your power distribution requirements. VH3H is our versatile, globally applicable solution for withdrawable air insulated switchgear, catering to utility, industrial, and infrastructure needs. Its compact design incorporates vacuum circuit breakers, offering a reliable and space-efficient Air-Insulated Switchgear solution at 36 kV.",
    "Image_Path": "/LK/lk_ea_products/images/VH3H.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/AIS_catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/medium-voltage/air-insulated-switchgear-ais/vh1h",
    "Brand": "Lauritz Knudsen",
    "Type": "MEDIUM VOLTAGE",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "VH1H",
    "Product_Type": "Air Insulated Switchgear - Ais",
    "Full_Description": "Our Air Insulated Switchgear offers unparalleled performance up to 36 kV and 50kA, along with a 3-second short circuit withstand capacity, ensuring reliability under intense conditions. With a Loss of Service Continuity-2B rating and IP4X protection, it guarantees uninterrupted operation even in challenging environments. Enhanced with additional customized safety interlocks, this switchgear prioritizes safety without compromising efficiency, demonstrated by its ability to handle numerous operating cycles and maintain optimal performance through efficient 10,000 switching operations. Leveraging our esteemed and validated designs, we've seamlessly integrated cutting-edge connected capabilities, including embedded arc flash protection and health monitoring sensors. At Lauritz Knudsen Electrical & Automation, we believe these advancements empower you to not only optimize the longevity and efficiency of your switchboard but also ensure utmost safety and reliability in your operations.",
    "Short_Description": "Engineered for unparalleled user safety and operational dependability, VH1H is an indoor switchgear assembly that sets a new standard for reliability and performance in the industry. Designed to meet a wide spectrum of electrical distribution requirements up to 12kV, VH1H integrates a suite of pioneering solutions, ensuring utmost reliability and performance.",
    "Image_Path": "/LK/lk_ea_products/images/VH1H.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/IRRD_flyer.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/medium-voltage/ring-main-unit-rmu/fr1-vi",
    "Brand": "Lauritz Knudsen",
    "Type": "MEDIUM VOLTAGE",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "FR1-VI",
    "Product_Type": "Ring Main Unit - Rmu",
    "Full_Description": "Introducing Lauritz Knudsen Electrical & Automation's Ring Main Unit, our innovative SF6 Gas Insulated switchgear, which is a compact, modular, and extendable solution engineered to meet the demands of secondary distribution network switching operations. Featuring six vacuum interrupter-based circuit breakers, this system offers a safe, reliable, and cost-effective option while demanding minimal maintenance. Engineered to withstand formidable conditions of 12kV/17.5kV and 21kA for 3 seconds, its outdoor design prioritizes safety with an intuitive mimic diagram and position indicators for secure operations. Some of the key features include protection against arc faults, live parts isolation ensuring operator safety, passive interlocks to prevent unintended operations, comprehensive padlocking facilities for secure access control, and mimic diagram and position indicators for precise guidance.",
    "Short_Description": "Introducing Lauritz Knudsen Electrical & Automation's Ring Main Unit, our innovative SF6 Gas Insulated switchgear, which is a compact, modular, and extendable solution engineered to meet the demands of secondary distribution network switching operations. Featuring six vacuum interrupter-based circuit breakers, this system offers a safe, reliable, and cost-effective option while demanding minimal maintenance. Engineered to withstand formidable conditions of 12kV/17.5kV and 21kA for 3 seconds, its outdoor design prioritizes safety with an intuitive mimic diagram and position indicators for secure operations. Some of the key features include protection against arc faults, live parts isolation ensuring operator safety, passive interlocks to prevent unintended operations, comprehensive padlocking facilities for secure access control, and mimic diagram and position indicators for precise guidance.",
    "Image_Path": "/LK/lk_ea_products/images/FR1-VI.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/IRRD_flyer.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/medium-voltage/compact-sub-station-css-or-packaged-sub-stations-pss/nqube",
    "Brand": "Lauritz Knudsen",
    "Type": "MEDIUM VOLTAGE",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "NQube",
    "Product_Type": "Compact Sub-Station - Css",
    "Full_Description": "Compact Sub-station, an integral part of Lauritz Knudsen Electrical & Automation's comprehensive product lineup. Engineered for outdoor applications and adhering to IEC 62271-202 standards, Compact Sub-station serves as a compact MV/LV substation, seamlessly integrating into secondary distribution networks. With Lauritz Knudsen's renowned electrical components at its core, Compact Sub-station ensures maintenance-free operation throughout its entire lifecycle, delivering unparalleled performance and peace of mind for your power distribution needs.",
    "Short_Description": "NQube, setting a new benchmark for excellence, is meticulously crafted to meet the standards of IEC 62271-202. It is suitable for LV Switchgear upto 2000A, 440V, Transformer upto 1250kVA and can accommodate 12kV, 630A, 21kA, RMU. Fully factory assembled and type-tested, it guarantees reliability and efficiency from the get-go. Its modular and compartmentalised design allows for easy customisation and maintenance, while the specially designed ventilation system reinforces its durability. With operator safety as a top priority, it provides a completely safe environment for personnel. Additionally, it comes ready for installation and network connection, making deployment swift and hassle-free. Furthermore, its SCADA compatibility and readiness for integration into smart grids position it at the forefront of modern power distribution technologies.",
    "Image_Path": "/LK/lk_ea_products/images/NQube.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/NQube_Flyer.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/medium-voltage/vacuum-circuit-breaker-vcb/vk-series",
    "Brand": "Lauritz Knudsen",
    "Type": "MEDIUM VOLTAGE",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "VK Series",
    "Product_Type": "Vacuum Circuit Breaker - Vcb",
    "Full_Description": "With offerings up to 33kV, our 'draw out' type VCBs provide unparalleled convenience and safety, allowing for direct racking out on the floor. Our VCBs are quite dependable and are used across varied Sector.",
    "Short_Description": "The VK Series VCBs are engineered to operate efficiently and prioritise user safety, drawing from years of experience. They are available up to 12kV with a short circuit breaking capacity of 50kA, reflecting their robust design and innovative approach.",
    "Image_Path": "/LK/lk_ea_products/images/VK Series.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/IRRD_flyer.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/lv-iec-panels/pcc-and-mcc-panels/enersys",
    "Brand": "Lauritz Knudsen",
    "Type": "LV IEC PANELS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Enersys",
    "Product_Type": "Pcc And Mcc Panels",
    "Full_Description": "Lauritz Knudsen is a leader in low-voltage electrical switchboards, delivering IEC-certified solutions that blend technical expertise, safety, and innovation. Built to meet global standards, Lauritz Knudsen switchboards are essential to modern & digital electrical distribution systems, ensuring reliable power flow across factories, infrastructure, and specialized industrial applications. Each unit is engineered for optimal performance, offering safe switching, metering, and circuit protection, with the flexibility to be customized for diverse operational needs. Featuring robust enclosures and precision-built components, Lauritz Knudsen switchboards enable efficient energy management, helping facilities operate with greater confidence, control, digitalization and sustainability.",
    "Short_Description": "Enersys by Lauritz Knudsen Electrical & Automation is more than a power distribution unit—it's a blend of smart engineering and digital innovation. Crafted for superior safety, reliability, and efficiency, it combines advanced technology with a sleek, modern look, ensuring your electrical systems are secure and future-proof. Enersys, a true smart panel, integrates advanced communication capabilities, intelligent thermal management, and eco-conscious engineering design for next-generation power solutions. Backed by Lauritz Knudsen Electrical & Automation’s 70-year legacy of powering India, it delivers reliable, future-ready electrical systems tailored for Indian conditions, blending performance with innovation.",
    "Image_Path": "/LK/lk_ea_products/images/Enersys.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Enersys.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/lv-iec-panels/pcc-and-mcc-panels/ti",
    "Brand": "Lauritz Knudsen",
    "Type": "LV IEC PANELS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Ti",
    "Product_Type": "Pcc And Mcc Panels",
    "Full_Description": "Lauritz Knudsen is a leader in low-voltage electrical switchboards, delivering IEC-certified solutions that blend technical expertise, safety, and innovation. Built to meet global standards, Lauritz Knudsen switchboards are essential to modern & digital electrical distribution systems, ensuring reliable power flow across factories, infrastructure, and specialized industrial applications. Each unit is engineered for optimal performance, offering safe switching, metering, and circuit protection, with the flexibility to be customized for diverse operational needs. Featuring robust enclosures and precision-built components, Lauritz Knudsen switchboards enable efficient energy management, helping facilities operate with greater confidence, control, digitalization and sustainability.",
    "Short_Description": "Ti by Lauritz Knudsen Electrical & Automation, a fully type – tested CDV (Complete Design Verified assembly) designed in accordance with the latest IEC 61439 1&2, offering a cutting-edge switchboard solution that embodies legacy of excellence in catering to Indian customers. Ti, Lauritz Knudsen Electrical and automation’s Deming Prize – winning TQM standards, which are evident in every aspect of Ti’s design, manufacture, and quality control. Ti also features state – of – the – art digitalization for remote monitoring and management and employs sustainable materials for environmental care.",
    "Image_Path": "/LK/lk_ea_products/images/Ti.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Ti_Catalogue_-_Final_Dec_2025.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/lv-iec-panels/sub-main-distribution-board-smdb/enersys-s",
    "Brand": "Lauritz Knudsen",
    "Type": "LV IEC PANELS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Enersys S",
    "Product_Type": "Sub-Main Distribution Board - Smdb",
    "Full_Description": "SMDB from Lauritz Knudsen Electrical and automation meet the demands of commercial buildings, educational establishments, hospitals, government buildings, manufacturing facilities and other applications that require safe, reliable & high performance protection of their electrical sub-distribution systems",
    "Short_Description": "Enersys-S Power Distribution board from Lauritz Knudsen Electrical and automation meet the demands of commercial buildings, educational establishments, hospitals, government buildings, manufacturing facilities and other applications that require safe, reliable & high performance protection of their electrical sub-distribution systems Enersys-S is a NABL tested Sub-Main Distribution Board used for power distribution. It has MCCB as incoming and outgoing switching-cum-protection devices. compact MCCB design ensures maximum cabling area within the enclosure Removable top and bottom glad plates are provided for ease of installation & cabling.",
    "Benefits": "Compact solution - Enersys-S saves almost 30% of floor space over conventional panels due to its compact PN system & MCCB's; Protection from risk of shock - Separate earthing for enclosure ensure operator safety; Ease of termination - Enersys-S facilitates separate earth and neutral bars on both the sides with the required number of cable termination points; Off the shelf assembly - Enersys-S is a ready-to-use solution for nay power distribution needs",
    "Image_Path": "/LK/lk_ea_products/images/Enersys S.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Enersys_S_SMDB_catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/power-distribution-products-lv-switchgear/air-circuit-breaker-acb/u-power-omega",
    "Brand": "Lauritz Knudsen",
    "Type": "POWER DISTRIBUTION PRODUCTS",
    "Image_Download_Status": "Not Found on Category Page",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "U-Power Omega",
    "Product_Type": "Air Circuit Breaker - Acb",
    "Full_Description": "Designed to protect electrical systems from damage due to excessive current caused by overloads, short circuits, and ground faults; Lauritz Knudsen Electrical & Automation are a leading manufacturer of Low Voltage Switchgear for over 50 years. Lauritz Knudsen Electrical & Automation’s Air Circuit Breakers are ideal for high-power applications in low-voltage distribution networks, offering reliability and compactness while meeting the needs of various industries.",
    "Short_Description": "Electrical protection is crucial for ensuring the safety and reliability of power systems. Electrical installations and equipment are susceptible to internal and external faults that can cause severe damage. Circuit Breakers are essential to detect and isolate faults promptly by early detection and localization of faults. Circuit Breakers also aim to minimize the fault duration and isolate faulty parts from the circuit. Electrical systems may experience excessive current caused by overloads, short circuits, and ground faults condition. Lauritz Knudsen Electrical & Automation is a leading manufacturer of Low Voltage Switchgear for over 70 years. Lauritz Knudsen Electrical & Automation’s OMEGA Air Circuit Breakers are ideal for high-power applications in low-voltage distribution networks, offering reliability and compactness & versatility while meeting the needs of various industries.",
    "Image_Path": "/LK/lk_ea_products/images/u-power.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Solar_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/power-distribution-products-lv-switchgear/air-circuit-breaker-acb/c-power",
    "Brand": "Lauritz Knudsen",
    "Type": "POWER DISTRIBUTION PRODUCTS",
    "Image_Download_Status": "Not Found on Category Page",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "C-Power",
    "Product_Type": "Air Circuit Breaker - Acb",
    "Full_Description": "Designed to protect electrical systems from damage due to excessive current caused by overloads, short circuits, and ground faults; Lauritz Knudsen Electrical & Automation are a leading manufacturer of Low Voltage Switchgear for over 50 years. Lauritz Knudsen Electrical & Automation’s Air Circuit Breakers are ideal for high-power applications in low-voltage distribution networks, offering reliability and compactness while meeting the needs of various industries.",
    "Short_Description": "Lauritz Knudsen Electrical & Automation offers C-Power range of Air Circuit Breakers (ACBs) up to 6300A, 100kA @415V, designed to safeguard electrical systems from overcurrent and short-circuit faults. C-Power ACBs are tailored to meet all power distribution system requirements, ensuring safe and efficient operation. With a modular design and standardized range, these ACBs are suitable for diverse electrical applications in Buildings, Infrastructure, Utilities and Industries. Special Solution for harsh/corrosive environments is also available in C-Power family",
    "Benefits": "Leveraging scalability, durability and connectivity, C-Power ACBs integrate technological aspects to enhance uptime and energy efficiency.; Engineered for extreme tropical conditions, these ACBs excel in challenging environments, setting a market benchmark for performance and safety.; With a common door cut-out for the entire range and uniform height and depth for ACBs up to 4000A, they offer flexibility and ease of use.; Entire range offers High Short time withstand capacity, Icu=Ics=Icw for 1 sec to achieve total selectivity and full uptime of system.",
    "Image_Path": "/LK/lk_ea_products/images/c-power.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/C-Power_ACB_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/power-distribution-products-lv-switchgear/moulded-case-circuit-breaker-mccb/dz",
    "Brand": "Lauritz Knudsen",
    "Type": "POWER DISTRIBUTION PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "DZ",
    "Product_Type": "Moulded Case Circuit Breaker - Mccb",
    "Full_Description": "The dsine range stands out with its state-of-the-art design, user-friendly features, and a broad spectrum of protection mechanisms, marking it as a leader in the new generation of MCCBs (Moulded Case Circuit Breakers). Recognised for its ergonomic design, aesthetic appeal, and compactness, it is specifically engineered to perform reliably under extreme tropical conditions, offering consistent functionality in high ambient and humid environments. This makes the dsine MCCBs ideal for demanding settings, always meeting the evolving needs of our customers, a testament to our in-depth analysis and responsiveness to customer feedback.",
    "Short_Description": "The DZ range of Moulded Case Circuit Breakers (MCCB) is specifically designed to accommodate the complexities of modern electrical systems in contemporary installations. This range stands out due to its substantially higher fault-breaking capacities, addressing the rigorous demands of evolving power distribution requirements efficiently and effectively. Responding to the shifting expectations of customers who seek economical yet reliable solutions, we have developed the DZ range of MCCBs that can operate up to 800V AC, with exceptional fault-breaking capacities reaching up to 200kA at 415V AC. Available in both thermal magnetic and electronic versions, these MCCBs provide comprehensive protection, encompassing advanced current, voltage, frequency, power, and harmonic-based safeguards. This versatility empowers system designers and users to select and implement protection schemes that best fit their specific requirements, ensuring tailored and robust electrical safety.",
    "Benefits": "No load line bias ensures balanced power distribution, enhancing system efficiency.; Finger-proof terminals increase safety by preventing accidental contact, crucial for maintaining secure operations.; Phase barriers included with MCCBs enhance safety by effectively preventing electrical arcing between phases.; A wide range of common internal and external accessories is available, offering extensive customisation options to meet specific system requirements.",
    "Image_Path": "/LK/lk_ea_products/images/DZ.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Solar_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/power-distribution-products-lv-switchgear/moulded-case-circuit-breaker-mccb/dn",
    "Brand": "Lauritz Knudsen",
    "Type": "POWER DISTRIBUTION PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "DN",
    "Product_Type": "Moulded Case Circuit Breaker - Mccb",
    "Full_Description": "The dsine range stands out with its state-of-the-art design, user-friendly features, and a broad spectrum of protection mechanisms, marking it as a leader in the new generation of MCCBs (Moulded Case Circuit Breakers). Recognised for its ergonomic design, aesthetic appeal, and compactness, it is specifically engineered to perform reliably under extreme tropical conditions, offering consistent functionality in high ambient and humid environments. This makes the dsine MCCBs ideal for demanding settings, always meeting the evolving needs of our customers, a testament to our in-depth analysis and responsiveness to customer feedback.",
    "Short_Description": "The dsine range stands out with its state-of-the-art design, user-friendly features, and a broad spectrum of protection mechanisms, marking it as a leader in the new generation of MCCBs (Moulded Case Circuit Breakers). Recognised for its ergonomic design, aesthetic appeal, and compactness, it is specifically engineered to perform reliably under extreme tropical conditions, offering consistent functionality in high ambient and humid environments. This makes the dsine MCCBs ideal for demanding settings, always meeting the evolving needs of our customers, a testament to our in-depth analysis and responsiveness to customer feedback. Understanding and anticipating the requirements of our customers, our contemporary range of MCCBs ensures complete customer satisfaction without compromise. Enhanced by a comprehensive selection of accessories, the dsine range provides complete solutions tailored to various customer applications. This integration ensures not only operational safety and reliability but also adds versatility to its use across different industries and systems, making it a robust choice for comprehensive electrical protection.",
    "Key_Features": "Breaking Capacity: Options available at 25kA, 36kA, 50kA, 70kA, and 100kA, ensuring robust protection against high fault levels.; Variants: Choose from 3-pole or 4-pole versions to suit different circuit configurations.; Compliance: Fully compliant with IEC60947-2, EN60947-2, and IS/IEC60947-2 standards, ensuring international quality and safety benchmarks.; Protection Releases: Features both thermal-magnetic and microprocessor-based protection releases, offering precise and reliable circuit protection.",
    "Benefits": "No load line bias ensures balanced power distribution without preferential pathways.; Finger-proof terminals enhance safety by preventing accidental contact.; Suitable for DC applications, offering versatility across different electrical setups.; Phase barriers are provided with MCCBs to enhance safety by preventing electrical arcing between phases.; A wide range of common internal and external accessories is available, enabling easy integration and customisation to meet specific system requirements.",
    "Image_Path": "/LK/lk_ea_products/images/DN.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/dSine_MCCB_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/power-distribution-products-lv-switchgear/moulded-case-circuit-breaker-mccb/dy",
    "Brand": "Lauritz Knudsen",
    "Type": "POWER DISTRIBUTION PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "DY",
    "Product_Type": "Moulded Case Circuit Breaker - Mccb",
    "Full_Description": "The dsine range stands out with its state-of-the-art design, user-friendly features, and a broad spectrum of protection mechanisms, marking it as a leader in the new generation of MCCBs (Moulded Case Circuit Breakers). Recognised for its ergonomic design, aesthetic appeal, and compactness, it is specifically engineered to perform reliably under extreme tropical conditions, offering consistent functionality in high ambient and humid environments. This makes the dsine MCCBs ideal for demanding settings, always meeting the evolving needs of our customers, a testament to our in-depth analysis and responsiveness to customer feedback.",
    "Short_Description": "The DY Series represents the next generation of MCCBs, distinguished by its state-of-the-art design that combines contemporary, user-friendly features with outstanding ergonomics, aesthetics, and compactness. This series excels in functionality and form, making it an ideal choice for modern electrical infrastructure needs. In terms of compliance, the DY Series adheres to the latest international standards including IS/IEC 60947-2, IEC 60947-2, and EN 60947-2. Each product in the range carries the CE marking, affirming its quality and safety for use even in humid environments. Furthermore, equipped with a wide array of accessories, the series ensures operational safety, reliability, and versatility, meeting even the most demanding system requirements.",
    "Benefits": "The design is compact, optimising space and simplifying installation processes.; No load line bias ensures balanced power distribution, enhancing system efficiency.; Finger-proof terminals increase safety by preventing accidental contact, crucial in maintaining secure operations.; Phase barriers included with MCCBs enhance safety by effectively preventing electrical arcing between phases.",
    "Image_Path": "/LK/lk_ea_products/images/DY.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/DU_DY_MCCB_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/power-distribution-products-lv-switchgear/moulded-case-circuit-breaker-mccb/du",
    "Brand": "Lauritz Knudsen",
    "Type": "POWER DISTRIBUTION PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "DU",
    "Product_Type": "Moulded Case Circuit Breaker - Mccb",
    "Full_Description": "The dsine range stands out with its state-of-the-art design, user-friendly features, and a broad spectrum of protection mechanisms, marking it as a leader in the new generation of MCCBs (Moulded Case Circuit Breakers). Recognised for its ergonomic design, aesthetic appeal, and compactness, it is specifically engineered to perform reliably under extreme tropical conditions, offering consistent functionality in high ambient and humid environments. This makes the dsine MCCBs ideal for demanding settings, always meeting the evolving needs of our customers, a testament to our in-depth analysis and responsiveness to customer feedback.",
    "Short_Description": "The DU Series represents the next generation of MCCBs, distinguished by its state-of-the-art design that combines contemporary, user-friendly features with outstanding ergonomics, aesthetics, and compactness. This series excels in functionality and form, making it an ideal choice for modern electrical infrastructure needs. In terms of compliance, the DU Series adheres to the latest international standards including IS/IEC 60947-2, IEC 60947-2, and EN 60947-2. Each product in the range carries the CE marking, affirming its quality and safety for use even in humid environments. Furthermore, equipped with a wide array of accessories, the series ensures operational safety, reliability, and versatility, meeting even the most demanding system requirements.",
    "Benefits": "The design is compact, optimising space and simplifying installation processes.; No load line bias ensures balanced power distribution, enhancing system efficiency.; Finger-proof terminals increase safety by preventing accidental contact, crucial in maintaining secure operations.; Phase barriers included with MCCBs enhance safety by effectively preventing electrical arcing between phases.",
    "Image_Path": "/LK/lk_ea_products/images/DU.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/DU_DY_MCCB_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/power-distribution-products-lv-switchgear/switch-disconnectors-switch-disconnector-fuses-sdf/fn",
    "Brand": "Lauritz Knudsen",
    "Type": "POWER DISTRIBUTION PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "FN",
    "Product_Type": "Switch Disconnectors & Switch Disconnector Fuses - Sdf",
    "Full_Description": "Guaranteed performance in challenging environment coupled with unmatched reliability, these switching solutions are thriving in ruling in innumerable industrial and commercial installations. These switches are easy to install, use and inspect. All the switches also come with standard protective features such as terminal shrouds, phase barriers and high ground clearances.",
    "Short_Description": "Guaranteed performance in challenging environment coupled with unmatched reliability, these switching solutions are thriving in ruling in innumerable industrial and commercial installations. These switches are easy to install, use and inspect. All the switches also come with standard protective. features such as terminal shrouds, phase barriers and high ground clearances.",
    "Benefits": "Door interlocking in ON position with defeat feature; Ample Space for termination in spacious SS enclosure version, no separate cable gland boxes required Clear ON/OFF indications.; Telescopic Shaft: Step-less depth adjustment; Suitable for aluminum termination.",
    "Image_Path": "/LK/lk_ea_products/images/FN.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/SD_&_SDF_catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/power-distribution-products-lv-switchgear/busbar-trunking-bbt/s-line",
    "Brand": "Lauritz Knudsen",
    "Type": "POWER DISTRIBUTION PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "S-Line",
    "Product_Type": "Busbar Trunking - Bbt",
    "Full_Description": "Lauritz Knudsen Electrical & Automation is the leading supplier of the S-Line Busbar Trunking System in over 30 countries. Whether you're setting up a Metro line or an industrial complex, our S-Line Busbar Trunking products meet all your power distribution needs using copper or aluminium busbars. The S-Line offers bus duct systems from 250A to 6300A, featuring flexible designs with uniform Class-F insulation, excellent insulation, and higher joint overlapping for longer life, higher savings, and enhanced safety.",
    "Short_Description": "Lauritz Knudsen Electrical & Automation is the leading supplier of the S-Line Busbar Trunking System in over 30 countries. Whether you're setting up a Metro line or an industrial complex, our S-Line Busbar Trunking products meet all your power distribution needs using copper or aluminium busbars. The S-Line offers bus duct systems from 250A to 6300A, featuring flexible designs with uniform Class-F insulation, excellent insulation, and higher joint overlapping for longer life, higher savings, and enhanced safety.",
    "Benefits": "Joint block with maintenance-free twin-headed shear-off nut, ensuring secure connections without the need for ongoing maintenance.; Plug-in box with mechanical interlock and enhanced safety features, providing secure and easy installation with added protection.; A robust, safe, and reliable solution, designed to meet high standards of durability and performance in demanding environments.",
    "Image_Path": "/LK/lk_ea_products/images/S-Line.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/S-Line_BBT_catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/power-distribution-products-lv-switchgear/changeover-switch/c-line",
    "Brand": "Lauritz Knudsen",
    "Type": "POWER DISTRIBUTION PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "C-Line",
    "Product_Type": "Change Over Switch - COS",
    "Full_Description": "Electrical & Automation (E&A) offers you a unique series of Changeover Switches combining compactness with high performance & customer convenience, thus, making it a state-of-the-art product in changeover technology",
    "Short_Description": "C-LINE ensures a high standard of safety through its dependable switching mechanism, which operates independently of the user’s speed of operation. This mechanism incorporates a fail-safe mechanical interlock for all 3 positions in the I-0-II versions. Additionally, the inclusion of I-0-II position indicators directly on the handle and mechanism further enhances operational safet",
    "Benefits": "Range from 40A to 2000A; Available in Open Execution, In SS Enclosure, Fused and Motorized version; User friendly features like; Staggered Terminals for ease in termination; Flippable handle for ease in operation; Dual Shaft position of centre and side; Fused version in form of kit; Higher Electrical and Mechanical Endurance; Higer Withstand Capacity; Frame 1 is DB mountable",
    "Image_Path": "/LK/lk_ea_products/images/C-Line.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/C-Line_Online_Change_Over_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/motor-management-control/contactors/mcx",
    "Brand": "Lauritz Knudsen",
    "Type": "MOTOR MANAGEMENT & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "MCX",
    "Product_Type": "Contactors",
    "Full_Description": "Lauritz Knudsen Electrical and Automation’s extensive array of contactors offers unparalleled versatility to cater to a broad spectrum of demands across various applications. Designed for motor control, capacitor switching, supply changeover, and other single-phase or three-phase applications, our contactors provide the optimal solution tailored to your specific needs. This selection is further enhanced by our comprehensive line of thermal overload relays, ensuring robust protection and seamless integration with your systems. In addition to our core offerings, we provide a diverse range of accessories to enhance and complete your electrical setups. These include thermal overload relays, surge suppressors, and mechanical interlock kits, each designed to augment the functionality and safety of our contactor solutions. These accessories are engineered to the highest standards, offering both reliability and performance to support complex electrical infrastructures.",
    "Short_Description": "The MCX range of 4-pole contactors, available from 18A to 900A AC-1, is extensively used with auto source transfer controllers to switch power from the main supply to backup sources such as DG (Diesel Generator) and UPS (Uninterruptible Power Supply).",
    "Benefits": "The accessories are common across the range and compatible with the MNX range, simplifying inventory management and reducing the need to stock multiple types of accessories.; A detailed selection chart based on the diesel generator (DG) rating is provided, making it straightforward for users to select the appropriate contactor.; The compact mechanical interlock arrangement for models up to 80A enhances safety by preventing the simultaneous closure of both sets of contacts.",
    "Image_Path": "/LK/lk_ea_products/images/MCX.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Motor_Management_&_Control_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/motor-management-control/contactors/mnx",
    "Brand": "Lauritz Knudsen",
    "Type": "MOTOR MANAGEMENT & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "MNX",
    "Product_Type": "Contactors",
    "Full_Description": "Lauritz Knudsen Electrical and Automation’s extensive array of contactors offers unparalleled versatility to cater to a broad spectrum of demands across various applications. Designed for motor control, capacitor switching, supply changeover, and other single-phase or three-phase applications, our contactors provide the optimal solution tailored to your specific needs. This selection is further enhanced by our comprehensive line of thermal overload relays, ensuring robust protection and seamless integration with your systems. In addition to our core offerings, we provide a diverse range of accessories to enhance and complete your electrical setups. These include thermal overload relays, surge suppressors, and mechanical interlock kits, each designed to augment the functionality and safety of our contactor solutions. These accessories are engineered to the highest standards, offering both reliability and performance to support complex electrical infrastructures.",
    "Short_Description": "MNX power contactors are primarily utilised in motor feeder and control system applications. With a range spanning from 9A to 650A (AC-3), they deliver dependable performance under various conditions, including high ambient temperatures and humidity. Additionally, accessories and spare parts are available for the entire range.",
    "Benefits": "High reliability ensures consistent performance and minimal downtime in demanding applications.; Easy access terminals from 50A and above simplify installation and maintenance, enhancing operational efficiency.; Suitable for DC-1, DC-3, and DC-5 applications, offering versatile usage across various direct current systems.; Accessories and spares are available for the entire range, facilitating customization and long-term maintenance.",
    "Image_Path": "/LK/lk_ea_products/images/MNX.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Type_2_Co-Ordination_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/motor-management-control/contactors/mo",
    "Brand": "Lauritz Knudsen",
    "Type": "MOTOR MANAGEMENT & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "MO",
    "Product_Type": "Contactors",
    "Full_Description": "Lauritz Knudsen Electrical and Automation’s extensive array of contactors offers unparalleled versatility to cater to a broad spectrum of demands across various applications. Designed for motor control, capacitor switching, supply changeover, and other single-phase or three-phase applications, our contactors provide the optimal solution tailored to your specific needs. This selection is further enhanced by our comprehensive line of thermal overload relays, ensuring robust protection and seamless integration with your systems. In addition to our core offerings, we provide a diverse range of accessories to enhance and complete your electrical setups. These include thermal overload relays, surge suppressors, and mechanical interlock kits, each designed to augment the functionality and safety of our contactor solutions. These accessories are engineered to the highest standards, offering both reliability and performance to support complex electrical infrastructures.",
    "Short_Description": "MO Contactors combine distinctive styling and visual appeal with dependable performance. Available in a range from 9A to 300A AC-3/3e, they are ideal for both general and specialised machinery. Their compact design saves panel space, and as RoHS compliant devices, they offer the advantages of being environmentally friendly and sustainable.",
    "Benefits": "Low panel footprint, saving valuable space in the control panel and allowing for more efficient use of available area.; Common spare parts for the MO family, minimising inventory requirements, reducing the need to stock multiple spare parts, simplifying maintenance, and lowering costs.; Type-2 chart available for motor applications, providing clear guidelines and ensuring reliable and optimised performance.; Lug and lugless termination options, offering flexibility in wiring methods and accommodating different installation preferences and requirements.; Shrouded design ensures user safety by protecting users from accidental contact with live components, enhancing operational safety.; Cassette type bridge facilitates easy inspection and maintenance, simplifying the process and reducing downtime, improving serviceability.",
    "Image_Path": "/LK/lk_ea_products/images/MO.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Type_2_Co-Ordination_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/motor-management-control/contactors/mo0",
    "Brand": "Lauritz Knudsen",
    "Type": "MOTOR MANAGEMENT & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "MO0",
    "Product_Type": "Contactors",
    "Full_Description": "Lauritz Knudsen Electrical and Automation’s extensive array of contactors offers unparalleled versatility to cater to a broad spectrum of demands across various applications. Designed for motor control, capacitor switching, supply changeover, and other single-phase or three-phase applications, our contactors provide the optimal solution tailored to your specific needs. This selection is further enhanced by our comprehensive line of thermal overload relays, ensuring robust protection and seamless integration with your systems. In addition to our core offerings, we provide a diverse range of accessories to enhance and complete your electrical setups. These include thermal overload relays, surge suppressors, and mechanical interlock kits, each designed to augment the functionality and safety of our contactor solutions. These accessories are engineered to the highest standards, offering both reliability and performance to support complex electrical infrastructures.",
    "Short_Description": "MO0 control contactors are fundamental 4-pole contactors available with both AC and DC control. These contactors can be utilised for constructing control logic. With add-on blocks, these contactors can provide up to 8 auxiliary contacts. They are suitable for both industrial and commercial installations.",
    "Benefits": "Finger-proof terminations ensure safe and secure auxiliary and control connections, reducing the risk of accidental contact.; Accessories are shared with the MO family of power contactors, thereby minimising inventory requirements and simplifying parts management.; Four auxiliary contacts are provided within a compact 45mm width, optimising space utilisation in installations.; An inbuilt surge suppressor in the MO0 DC model protects against voltage spikes, enhancing the reliability and lifespan of the contactor.; A common coil suitable for both 50Hz and 60Hz applications offers flexibility and reduces the need for multiple coil variants.",
    "Image_Path": "/LK/lk_ea_products/images/MO0.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Motor_Management_&_Control_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/motor-management-control/contactors/mo-c",
    "Brand": "Lauritz Knudsen",
    "Type": "MOTOR MANAGEMENT & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "MO C",
    "Product_Type": "Contactors",
    "Full_Description": "Lauritz Knudsen Electrical and Automation’s extensive array of contactors offers unparalleled versatility to cater to a broad spectrum of demands across various applications. Designed for motor control, capacitor switching, supply changeover, and other single-phase or three-phase applications, our contactors provide the optimal solution tailored to your specific needs. This selection is further enhanced by our comprehensive line of thermal overload relays, ensuring robust protection and seamless integration with your systems. In addition to our core offerings, we provide a diverse range of accessories to enhance and complete your electrical setups. These include thermal overload relays, surge suppressors, and mechanical interlock kits, each designed to augment the functionality and safety of our contactor solutions. These accessories are engineered to the highest standards, offering both reliability and performance to support complex electrical infrastructures.",
    "Short_Description": "MO C Capacitor Duty Contactors are specially designed for capacitor switching applications. As capacitor switching is associated with high inrush current, the contactors are provided with damping resistors which limit the value of inrush current to a safe value. The contactors are used in APFC panels for switching power capacitors depending upon the amount of reactive power compensation required",
    "Benefits": "Modular design saving precious panel space, optimising the utilisation of available area in electrical panels.; De-latching auxiliary contacts for improved switching, enhancing performance and reliability during operations.; Aesthetics and accessories same as MO Contactors, thus reducing the inventory by maintaining consistency across components.; Separate termination for damping resistors, ensuring easier installation and maintenance, and improving overall system organisation.",
    "Image_Path": "/LK/lk_ea_products/images/MO C.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Motor_Management_&_Control_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/motor-management-control/industrial-starter/mn-starter",
    "Brand": "Lauritz Knudsen",
    "Type": "MOTOR MANAGEMENT & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "MN Starter",
    "Product_Type": "Industrial Starter",
    "Full_Description": "MN range of industrial starters offers complete motor starting solution for industrial applications. These starters are time tested for reliable performance. They are a proven work horse for stand-alone motors in the industry.",
    "Short_Description": "MN range of industrial starters offers complete motor starting solution for industrial applications. These starters are time tested for reliable performance. They are a proven work horse for stand-alone motors in the industry.",
    "Benefits": "Single Phasing Protection ensures the motor is safeguarded against damage caused by single phasing, preserving its longevity and preventing costly repairs.; Auto-Manual Reset Switch offers the convenience of automatic or manual reset options, allowing for flexibility in resetting the motor starter based on operational needs.; Trip Test Facility facilitates easy testing of the trip mechanism, enabling quick identification and resolution of potential issues to maintain optimal performance.; Electronic Timer in MN FASD for High Accuracy incorporates an electronic timer in the MN FASD model, delivering precise timing functionality for enhanced control and operational accuracy.",
    "Image_Path": "/LK/lk_ea_products/images/MN Starter.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Type_2_Co-Ordination_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/motor-management-control/motor-protection-circuit-breaker/mog",
    "Brand": "Lauritz Knudsen",
    "Type": "MOTOR MANAGEMENT & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "MOG",
    "Product_Type": "Motor Protection Circuit Breaker",
    "Full_Description": "The Supernova series motor protection circuit breaker (MPCB) from  Lauritz Knudsen Electrical and Automation seamlessly combines the functions of a moulded case circuit breaker (MCCB) and a thermal overload relay into a singular, highly compact unit. Featuring an adjustable current range dial with a precise maximum/minimum ratio of 1.4 to 1.6, the MPCB can be finely tuned to the rated current of the motor, ensuring optimal protection. This unit is specifically designed to safeguard against short circuits and overload conditions, enhancing the reliability and efficiency of motor operations. The design of the Supernova series MPCB incorporates overload relay functions within its compact framework, significantly reducing the required installation space and wiring complexity. This integration facilitates a more streamlined panel design, allowing for a reduction in overall panel size. Such design efficiency not only optimises space but also simplifies installation and maintenance processes, making it an ideal solution for diverse industrial applications.",
    "Short_Description": "MOG MPCB combines short circuit protection and overload relay functionality in a highly compact unit. The MPCB is suitable for a wide range of small to medium motor loads that require high breaking capacity. Additionally, its compact size allows for a smaller installation area with reduced wiring space, thereby minimizing panel space.",
    "Benefits": "Compact design allows for a smaller installation area, saving valuable panel space.; Provides high breaking capacity for effective fault current interruption.; Ensures reliable short circuit protective coordination, reducing equipment damage.; Integrated features reduce wiring work, simplifying installation and cutting labour costs.; High switching durability ensures long-lasting performance in demanding applications.",
    "Image_Path": "/LK/lk_ea_products/images/MOG.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Type_2_Co-Ordination_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/motor-management-control/electronic-motor-protection-relays/immr",
    "Brand": "Lauritz Knudsen",
    "Type": "MOTOR MANAGEMENT & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "IMMR",
    "Product_Type": "Electronic Motor Protection Relays",
    "Full_Description": "Motors play an important role in any industry and impact plant’s efficiency and energy consumption. It is, therefore, vital to protect your motor installations. Different motor installations require different types of protection. At Lauritz Knudsen Electrical & Automation, we understand the need of the industry and offer an Intelligent Motor Management Relay (iMMR) for reliable protection, control and monitoring of electrical motors. Designed for use in the Intelligent motor control center, iMMR helps you to run your operation with reliable and effective protection against current/voltage variation, overload and earth fault. The iMMR provides detailed information about operational and diagnostic data in real-time that allows you to take corrective actions and avoid unexpected production downtime, losses and breakdowns. The compact design with built-in pre-programmed starter logic reduces manufacturing and commissioning time. iMMR suite software is available for easy and effective configuration, operation and diagnosis of the iMMR. Complex gate logic building is quite easy with the help of this iMMR suite software.",
    "Short_Description": "Motors play an important role in any industry and impact plant’s efficiency and energy consumption. It is, therefore, vital to protect your motor installations. Different motor installations require different types of protection. At Lauritz Knudsen Electrical & Automation, we understand the need of the industry and offer an Intelligent Motor Management Relay (iMMR) for reliable protection, control and monitoring of electrical motors.",
    "Benefits": "Designed for use in the Intelligent motor control center, iMMR helps you to run your operation with reliable and effective protection against current/voltage variation, overload and earth fault.; The iMMR provides detailed information about operational and diagnostic data in real-time that allows you to take corrective actions and avoid unexpected production downtime, losses and breakdowns.; The compact design with built-in pre-programmed starter logic reduces manufacturing and commissioning time.; iMMR suite software is available for easy and effective configuration, operation and diagnosis of the iMMR.",
    "Image_Path": "/LK/lk_ea_products/images/IMMR.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/iMMR_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/ac-drive/xd1000",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "xD1000",
    "Product_Type": "Ac Drive",
    "Full_Description": "With over four decades of engineering excellence, Lauritz Knudsen presents the xD Series AC Drives. This product, part of our Industrial Automation portfolio, goes beyond technology. It is engineered to deliver efficiency, reliability, and control. Whether you're managing HVAC systems, water treatment facilities, manufacturing lines, or process automation setups, the xD Series is designed to optimize motor control and enhance energy efficiency across a wide range of industrial applications.",
    "Short_Description": "The xD1000 Drive is a compact yet robust variable frequency drive (VFD) designed to meet the needs of various general-purpose applications such as pump, fan, conveyor & compressors cutting across Industry & Building segments. It is also capable to handle machine applications like F&B machines, packaging machines, woodworking machines, textile machines, special purpose machines etc. It offers a user-friendly interface that simplifies installation and operation, making it accessible for both experienced and novice users. The xD1000 is equipped with advanced motor control features that enhance performance while optimizing energy consumption, contributing to lower operational costs. With its robust design and adaptability, the xD1000 Drive is an excellent choice for improving energy efficiency and reliability in diverse environments.",
    "Benefits": "Built in PID with 4 preset PID references, Wake up & sleep mode, PID predictive speed; Auxiliary pump function (1 master + 1 slave); Torque boost; Stall prevention; Skip frequency; Catch on the fly (speed search / flying start); Fault inhibition (Fire mode); DC braking; Slip compensation; 8 preset speeds",
    "Image_Path": "/LK/lk_ea_products/images/xD1000.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/xD_Series_Catalouge.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/ac-drive/xd2000",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "xD2000",
    "Product_Type": "Ac Drive",
    "Full_Description": "With over four decades of engineering excellence, Lauritz Knudsen presents the xD Series AC Drives. This product, part of our Industrial Automation portfolio, goes beyond technology. It is engineered to deliver efficiency, reliability, and control. Whether you're managing HVAC systems, water treatment facilities, manufacturing lines, or process automation setups, the xD Series is designed to optimize motor control and enhance energy efficiency across a wide range of industrial applications.",
    "Short_Description": "The xD2000 Drive is a high-performance variable frequency drive designed to deliver exceptional control and efficiency for a variety of utility applications with its advanced control capabilities. The xD2000 allows for seamless integration into automation systems, enhancing overall operational performance. Its robust design ensures reliability in demanding environments, while features like energy-saving modes help reduce operational costs. The user-friendly interface simplifies setup and adjustments, making the xD2000 an ideal choice for both new installations and upgrades",
    "Benefits": "Inbuilt DC Reactor; Inbuilt EMC filter; Busbar plating to avoid chemical gas corrosion; Robust galvanic isolation; Inbuilt detachable LCD Display; Control of Permanent Magnet Synchronous Motors; Built in PID with 4 preset PID references, Wake up & sleep mode, PID predictive speed; Booster Pump Control; Stall prevention; Skip frequency",
    "Image_Path": "/LK/lk_ea_products/images/xD2000.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/xD_Series_Catalouge.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/ac-drive/xd3000",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "xD3000",
    "Product_Type": "Ac Drive",
    "Full_Description": "With over four decades of engineering excellence, Lauritz Knudsen presents the xD Series AC Drives. This product, part of our Industrial Automation portfolio, goes beyond technology. It is engineered to deliver efficiency, reliability, and control. Whether you're managing HVAC systems, water treatment facilities, manufacturing lines, or process automation setups, the xD Series is designed to optimize motor control and enhance energy efficiency across a wide range of industrial applications.",
    "Short_Description": "The xD3000 Drive is a versatile and high-performance variable frequency drive designed for a wide range of OEM applications. With its compact design and robust features, the xD3000 offers seamless integration into various industrial environments. It supports advanced motor control algorithms and includes built-in connectivity options, allowing for easy integration with automation systems. While, xD3000 is engineered for energy efficiency, safety of machines, it also help businesses to reduce operational costs & maintaining optimal performance. Its user-friendly interface ensures quick setup and ease of use, making it an excellent choice for both new installations and retrofits.",
    "Benefits": "Control of Permanent Magnet Synchronous Motors; Motor surge limit function for Old, Poor quality, Rewound Motors; Delinearization for Analog Inputs; High frequency range up to 599Hz for high-speed motors; Reference Addition, Subtraction & Multiplication; Hoisting - External Brake Control, Load (External Weight) Measurement, High-speed Hoisting, Rope Slack; Motor / Generator Torque Limit; Load sharing; Line Contactor Control; Output Contactor Control",
    "Image_Path": "/LK/lk_ea_products/images/xD3000.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/xD_Series_Catalouge.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/ac-drive/xd4000",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "xD4000",
    "Product_Type": "Ac Drive",
    "Full_Description": "With over four decades of engineering excellence, Lauritz Knudsen presents the xD Series AC Drives. This product, part of our Industrial Automation portfolio, goes beyond technology. It is engineered to deliver efficiency, reliability, and control. Whether you're managing HVAC systems, water treatment facilities, manufacturing lines, or process automation setups, the xD Series is designed to optimize motor control and enhance energy efficiency across a wide range of industrial applications.",
    "Short_Description": "The xD4000 Drive is a highly advanced variable frequency drive designed for demanding applications in industries such as manufacturing, water treatment, and process automation. Featuring a powerful control algorithm, the xD4000 provides precise motor control and exceptional performance, ensuring optimal operation across various load conditions. Its extensive connectivity options enable easy integration with existing automation systems, while built-in energy-saving features help reduce operational costs. The xD4000 also boasts a user-friendly interface for quick setup and intuitive operation, making it an excellent choice for enhancing efficiency and productivity in any industrial environment.",
    "Benefits": "Inbuilt EMC Filter C2 & C3; Inbuilt DC Reactor entire range; Inbuilt braking transistor upto 160kW HD; Interactive & easy to use Graphical LCD keypad with help menu, battery for RTC & QR code for troubleshooting; Abundant multifunctional IOs for field interface; Sucker rod function; Backspin sequence for PCP; Load sharing (Speed & Torque); Backlash compensation; Built in PID with 4 preset PID references, Wake up & sleep mode, Sleep Boost, PID predictive speed",
    "Image_Path": "/LK/lk_ea_products/images/xD4000.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/xD_Series_Catalouge.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/ac-drive/sx2000",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Sx2000",
    "Product_Type": "Ac Drive",
    "Full_Description": "With over four decades of engineering excellence, Lauritz Knudsen presents the xD Series AC Drives. This product, part of our Industrial Automation portfolio, goes beyond technology. It is engineered to deliver efficiency, reliability, and control. Whether you're managing HVAC systems, water treatment facilities, manufacturing lines, or process automation setups, the xD Series is designed to optimize motor control and enhance energy efficiency across a wide range of industrial applications.",
    "Short_Description": "The Sx2000 drives offer a reliable solution for various industrial applications. With advanced control features and robust design, these drives provide efficient and precise motor control. They are engineered to deliver consistent performance in diverse operating conditions, making them a trusted choice for high-quality motor control solutions. Further enhancing their appeal, the Sx2000 drives are designed for easy integration into existing systems, offering scalable options to meet the specific needs of any application. They support a wide range of motor types, including AC induction motors, ensuring flexibility in deployment. This adaptability, combined with their user-friendly interface, simplifies setup and maintenance, helping to reduce downtime and operational costs.",
    "Benefits": "The integrated EMC filter minimizes electromagnetic interference, ensuring smoother operation.; The built-in DC reactor enhances energy efficiency and reduces harmonic distortion.; Output voltage control allows for precise adjustments to meet specific application requirements.; The KEB and Flying Start feature facilitates smooth restarts under dynamic loads without the need to reset.; Programmable user sequences enable customisable control for specific sequences and operations.; The multi-keypad interface offers user-friendly access for adjustments and monitoring.",
    "Image_Path": "/LK/lk_ea_products/images/Sx2000.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/AC_Drive_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/ac-drive/fx2000",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Fx2000",
    "Product_Type": "Ac Drive",
    "Full_Description": "With over four decades of engineering excellence, Lauritz Knudsen presents the xD Series AC Drives. This product, part of our Industrial Automation portfolio, goes beyond technology. It is engineered to deliver efficiency, reliability, and control. Whether you're managing HVAC systems, water treatment facilities, manufacturing lines, or process automation setups, the xD Series is designed to optimize motor control and enhance energy efficiency across a wide range of industrial applications.",
    "Short_Description": "The Fx2000 drives are renowned for their robust construction and seamless functionality, establishing them as a top choice for industrial motor control applications. Engineered to deliver exceptional performance, these drives combine energy efficiency with reliable operation, meeting the varied demands of different industries. Their user-friendly features and advanced control capabilities make the Fx2000 drives an effective solution for boosting productivity and optimising processes. LK's Fx2000 drives are distinguished by their ability to provide efficient and customised motor control solutions, making them a reliable option for businesses aiming to enhance operational efficiency. With a focus on durability and adaptability, these drives support a range of industrial activities, ensuring that they not only meet but exceed the expectations of users in terms of performance and ease of use.",
    "Benefits": "Brake control manages braking mechanisms efficiently, ensuring quick and safe stops that enhance operational safety and reduce wear on the system.; Kinetic energy buffering captures and reuses energy, which enhances overall efficiency during dynamic operations and reduces power consumption.; Output voltage control allows for precise voltage adjustments, optimising motor performance and ensuring optimal energy use.; The regeneration evasion function for press applications prevents energy backflow, improving both safety and equipment longevity in demanding industrial settings.",
    "Image_Path": "/LK/lk_ea_products/images/Fx2000.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/AC_Drive_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/ac-drive/hx2000",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Hx2000",
    "Product_Type": "Ac Drive",
    "Full_Description": "With over four decades of engineering excellence, Lauritz Knudsen presents the xD Series AC Drives. This product, part of our Industrial Automation portfolio, goes beyond technology. It is engineered to deliver efficiency, reliability, and control. Whether you're managing HVAC systems, water treatment facilities, manufacturing lines, or process automation setups, the xD Series is designed to optimize motor control and enhance energy efficiency across a wide range of industrial applications.",
    "Short_Description": "Engineered to deliver exceptional precision and control, the Hx2000 AC drives enhance motor efficiency and productivity in a variety of HVAC applications. Featuring advanced technologies such as vector control and adaptive algorithms, these drives optimise motor performance, significantly reducing energy consumption. This makes them an ideal choice for industries aiming to streamline operations and cut costs, while maintaining high performance standards. The Hx2000 AC drives combine excellence and reliability, offering a robust solution suited to demanding industrial environments. They ensure smooth and consistent operation, day in and day out, providing businesses with the confidence that their motor-driven systems will perform reliably under various conditions. This reliability, coupled with enhanced efficiency, positions the Hx2000 drives as essential tools for improving operational effectiveness and sustainability.",
    "Benefits": "Sub TitleThe pre-defined MACRO feature simplifies the initial setup process, enabling quick and efficient configuration tailored to specific applications, which accelerates deployment and reduces downtime.; Integrated EMC filtering enhances operational stability by reducing electromagnetic interference, ensuring compliance with international standards and protecting other sensitive electronics from disruptions.; Time Event Scheduling, alongside the Real Time Clock, automates operations based on precise timing, which optimises processes and improves overall system efficiency without manual intervention.; Multi Motor Control and the capability to operate a second motor from a single drive provide substantial cost savings and system simplification, allowing for streamlined management of multiple motor setups.",
    "Image_Path": "/LK/lk_ea_products/images/Hx2000.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/AC_Drive_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/ac-drive/nx2000",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Nx2000",
    "Product_Type": "Ac Drive",
    "Full_Description": "With over four decades of engineering excellence, Lauritz Knudsen presents the xD Series AC Drives. This product, part of our Industrial Automation portfolio, goes beyond technology. It is engineered to deliver efficiency, reliability, and control. Whether you're managing HVAC systems, water treatment facilities, manufacturing lines, or process automation setups, the xD Series is designed to optimize motor control and enhance energy efficiency across a wide range of industrial applications.",
    "Short_Description": "SuThe Nx2000 AC drives represent a transformative advancement in industrial automation technology. Engineered to deliver unmatched performance and versatility, these drives are ideal for controlling electric motors across a wide range of industrial applications. With a focus on precision and reliability, the Nx2000 drives incorporate advanced features such as precise speed control, adaptive algorithms, and comprehensive protection mechanisms. These capabilities ensure optimal efficiency and enhanced safety during operation, making them a critical component in modern industrial setups. LK's longstanding expertise and commitment to quality are evident in the design and functionality of the Nx2000 AC drives. These drives empower industries to achieve new heights in productivity, efficiency, and operational excellence. Whether used in manufacturing, processing, or other demanding environments, the Nx2000 drives offer a robust solution that significantly improves system performance while maintaining high standards of energy efficiency and reliability.",
    "Benefits": "DIN rail mounting available up to 2.2kW provides a flexible and space-efficient installation option, simplifying setup in various industrial environments.; The integrated EMC filter reduces electromagnetic interference, ensuring stable and reliable operation of the drive under all conditions.; Side by side installation allows for compact use of space, enabling the placement of multiple drives close together without risk of overheating.; The remote expansion keypad enables convenient operation from a distance, improving accessibility and user comfort in managing drive settings and monitoring performance.",
    "Image_Path": "/LK/lk_ea_products/images/Nx2000.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/AC_Drive_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/soft-starters/xs1000",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "xS1000",
    "Product_Type": "Soft Starters",
    "Full_Description": "LK-EA provides a variety of soft starters engineered to manage the starting and stopping of induction motors. These soft starters minimise mechanical stress on both the motor and the connected equipment, ensuring smoother operation and prolonging the lifespan of the machinery. Additionally, they offer motor protection, advanced communication options, and energy-saving features. LK's soft starters are perfect for diverse industrial applications, delivering dependable and efficient motor control solutions.",
    "Short_Description": "The xS1000 Soft Starter is a solution for the controlled starting and stopping of induction motors. The xS1000 Soft Starter offers seamless integration, advanced motor protection features, and a user-friendly interface for easy operation. With its compact design and comprehensive functionality, the xS1000 Soft Starter is well-suited for diverse industrial applications, providing reliable and energy-efficient motor control. Its robust construction and advanced features make it a top choice for optimizing motor performance and enhancing operational efficiency.",
    "Image_Path": "/LK/lk_ea_products/images/xS1000.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Soft_Starter_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/soft-starters/xs2000",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "xS2000",
    "Product_Type": "Soft Starters",
    "Full_Description": "LK-EA provides a variety of soft starters engineered to manage the starting and stopping of induction motors. These soft starters minimise mechanical stress on both the motor and the connected equipment, ensuring smoother operation and prolonging the lifespan of the machinery. Additionally, they offer motor protection, advanced communication options, and energy-saving features. LK's soft starters are perfect for diverse industrial applications, delivering dependable and efficient motor control solutions.",
    "Short_Description": "The xS2000 Soft Starter engineered to ensure smooth and efficient motor control while mitigating issues associated with direct-on-line starting, such as high inrush currents and mechanical stress. The xS2000 Soft Starter features advanced motor protection, integrated bypass, and a user-friendly interface, offering seamless integration and easy operation. Its compact design and comprehensive functionality make it suitable for a wide array of industrial applications, delivering reliable and energy-efficient motor control. With its robust construction and advanced features, the xS2000 Soft Starter stands as a top choice for optimizing motor performance and ensuring operational excellence.",
    "Image_Path": "/LK/lk_ea_products/images/xS2000.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Soft_Starter_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/soft-starters/xs3000",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "xS3000",
    "Product_Type": "Soft Starters",
    "Full_Description": "LK-EA provides a variety of soft starters engineered to manage the starting and stopping of induction motors. These soft starters minimise mechanical stress on both the motor and the connected equipment, ensuring smoother operation and prolonging the lifespan of the machinery. Additionally, they offer motor protection, advanced communication options, and energy-saving features. LK's soft starters are perfect for diverse industrial applications, delivering dependable and efficient motor control solutions.",
    "Short_Description": "The LK-EA xS3000 Soft Starter is a cutting-edge solution designed to efficiently control the Starting & Stopping of three-phase induction motors, providing seamless and reliable operation while minimizing mechanical stress and power distribution issues. With its advanced motor protection features and intelligent control algorithms, the xS3000 ensures smooth and controlled motor starting and stopping, contributing to enhanced system longevity and reduced maintenance costs. Equipped with a user-friendly interface and comprehensive monitoring capabilities, this soft starter is an ideal choice for applications across various industries, offering optimal performance and energy efficiency.",
    "Image_Path": "/LK/lk_ea_products/images/xS3000.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Soft_Starter_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/soft-starters/xs4000",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Not Found on Category Page",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "xS4000",
    "Product_Type": "Soft Starters",
    "Full_Description": "LK-EA provides a variety of soft starters engineered to manage the starting and stopping of induction motors. These soft starters minimise mechanical stress on both the motor and the connected equipment, ensuring smoother operation and prolonging the lifespan of the machinery. Additionally, they offer motor protection, advanced communication options, and energy-saving features. LK's soft starters are perfect for diverse industrial applications, delivering dependable and efficient motor control solutions.",
    "Short_Description": "The xS4000 Soft Starter is designed to provide seamless and efficient control for induction motors. It offers advanced features such as integrated bypass, built-in motor protection, and a user-friendly interface, making it suitable for a wide range of industrial applications. The xS4000 Soft Starter also incorporates advanced communication options, energy optimization capabilities, and robust construction, ensuring reliable and smooth motor operations while minimizing wear and tear. With its comprehensive set of features, the xS4000 Soft Starter stands as a top choice for optimizing motor performance and ensuring operational excellence.",
    "Image_Path": "/LK/lk_ea_products/images/xs4000.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Soft_Starter_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/energy-management-products/power-quality-and-power-factor-correction/ultra-heavy-capacitors",
    "Brand": "Lauritz Knudsen",
    "Type": "ENERGY MANAGEMENT PRODUCTS",
    "Image_Download_Status": "Not Found on Category Page",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Ultra Heavy Capacitors",
    "Product_Type": "Power Quality And Power Factor Correction",
    "Full_Description": "Laurtiz Knudsen Electrical & Automation provides a comprehensive selection of Power Factor Capacitors tailored to lower overall power usage and enhance system efficiency. Our solution not only aids in maintaining the necessary power factor but also contributes to reducing electricity costs. Engineered with top-notch safety features like self-healing technology and overpressure disconnector fuse, our capacitors ensure utmost safety. We offer various Capacitor technologies including Metallised Poly Propylene (MPP) and Aluminum Poly Propylene (APP) films. MPP Capacitors come in Standard Duty, Heavy Duty, and Super Heavy-Duty ranges. On the other hand, APP Capacitors are available in box configuration across APP and Ultra Heavy-Duty Capacitors ranges, featuring internal fuse elements for added protection.",
    "Short_Description": "The LTXL ultra-heavy duty box capacitors are advanced Aluminium Poly Propylene type capacitors. They can withstand heavy load fluctuations, high inrush current and harmonics. They can be used in applications such as welding, steel rolling, etc., with heavy load fluctuations, high harmonic distortion levels (non-linear load >15%) and systems with high dv / dt.",
    "Benefits": "Suitable for harsh environments with heavy load fluctuations and high thermal loading like steel plants, automobile, cement plants, and fabrication industries.; Ideal for mid to large-scale heavy industrial applications.; Extended long life of 300,000 hours, reducing maintenance frequency and costs.; Designed to withstand Indian tropical conditions with temperatures up to 70°C, ensuring optimal performance in challenging environments.",
    "Image_Path": "/LK/lk_ea_products/images/ultra_heavy_capacitor.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/PQS_Catalogue_Domastic_01.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/energy-management-products/power-quality-and-power-factor-correction/heavy-duty-capacitors",
    "Brand": "Lauritz Knudsen",
    "Type": "ENERGY MANAGEMENT PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Heavy Duty Capacitors",
    "Product_Type": "Power Quality And Power Factor Correction",
    "Full_Description": "Laurtiz Knudsen Electrical & Automation provides a comprehensive selection of Power Factor Capacitors tailored to lower overall power usage and enhance system efficiency. Our solution not only aids in maintaining the necessary power factor but also contributes to reducing electricity costs. Engineered with top-notch safety features like self-healing technology and overpressure disconnector fuse, our capacitors ensure utmost safety. We offer various Capacitor technologies including Metallised Poly Propylene (MPP) and Aluminum Poly Propylene (APP) films. MPP Capacitors come in Standard Duty, Heavy Duty, and Super Heavy-Duty ranges. On the other hand, APP Capacitors are available in box configuration across APP and Ultra Heavy-Duty Capacitors ranges, featuring internal fuse elements for added protection.",
    "Short_Description": "E&A’s Heavy-Duty Capacitors are metalized polypropylene capacitors available from 1-33.1 kVAr in cylindrical and from 1-50 kVAr in box type construction. These capacitors have an inrush current withstand of 300 In and an overload withstand capacity of 1.8 In. These capacitors have all the features of standard capacitors like over pressure disconnector and self-healing.",
    "Benefits": "Available in 440 V, 480 V and 525 V.; Suitable for Industrial application; Designed for Indian conditions; Available in a wide range (1 kVAr to 33.1 kVAr in Cyl) & (1 kVAr to 50 kVAr in Box) to meet demanding requirements.; Compact and space-saving design offers flexibility and easy assembly.; Operating Life 1,50,000 hrs",
    "Image_Path": "/LK/lk_ea_products/images/Heavy Duty Capacitors.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/PQS_Catalogue_Domastic_01.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/energy-management-products/power-quality-and-power-factor-correction/heavy-gas-filled-capacitors",
    "Brand": "Lauritz Knudsen",
    "Type": "ENERGY MANAGEMENT PRODUCTS",
    "Image_Download_Status": "Not Found on Category Page",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Heavy - Gas filled Capacitors",
    "Product_Type": "Power Quality And Power Factor Correction",
    "Full_Description": "Laurtiz Knudsen Electrical & Automation provides a comprehensive selection of Power Factor Capacitors tailored to lower overall power usage and enhance system efficiency. Our solution not only aids in maintaining the necessary power factor but also contributes to reducing electricity costs. Engineered with top-notch safety features like self-healing technology and overpressure disconnector fuse, our capacitors ensure utmost safety. We offer various Capacitor technologies including Metallised Poly Propylene (MPP) and Aluminum Poly Propylene (APP) films. MPP Capacitors come in Standard Duty, Heavy Duty, and Super Heavy-Duty ranges. On the other hand, APP Capacitors are available in box configuration across APP and Ultra Heavy-Duty Capacitors ranges, featuring internal fuse elements for added protection.",
    "Short_Description": "Lauritz Knudsen Electrical & Automation's Gas-filled Heavy Duty Plus capacitors come in cylindrical configurations, ranging from 3 to 30 kVAr. With a lifespan of 150,000 hours, these Heavy Duty Plus capacitors offer durability and reliability. After an extensive drying process, they are filled with an inert gas to safeguard against corrosion of internal components. These capacitors boast an impressive inrush withstand of 300 times In and an overload withstand capacity of 1.8 times In. Safety features include an over-pressure disconnector and self-healing mechanisms. Their compact design ensures efficient space utilization.",
    "Benefits": "Available in 440V, 480V, and 525V variants, these capacitors offer flexibility with voltage options.; Suitable for heavy industrial applications, these capacitors provide reliable performance even in demanding environments.; Designed for Indian conditions ensure consistent performance and longevity.; Compact and space-saving design makes them suitable for installations where space is limited or where maximizing space utilization is important.",
    "Image_Path": "/LK/lk_ea_products/images/heavy_gas_filled_capacitor.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/PQS_Catalogue_Domastic_01.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/energy-management-products/apfc-relays/etasmart",
    "Brand": "Lauritz Knudsen",
    "Type": "ENERGY MANAGEMENT PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "ETASMART",
    "Product_Type": "Apfc Relays",
    "Full_Description": "The etaSMART APFC Controller rectifies power factor automatically through the connection and disconnection of capacitors. Equipped with a specially formulated optimisation program embedded in its microcontroller, it guarantees precise power factor regulation at the designated set point, ensuring smooth and uninterrupted operation.",
    "Short_Description": "The etaSMART APFC Controller rectifies power factor automatically through the connection and disconnection of capacitors. Equipped with a specially formulated optimization program embedded in its microcontroller, it guarantees precise power factor regulation at the designated set point, ensuring smooth and uninterrupted operation.",
    "Benefits": "It caters to a wide range of setups with both 2 and 4 quadrant operation capabilities, accommodating sites with or without solar plants.; Simplifies setup procedures, making it easy to program the controller automatically, saving time and effort.; With CT Secondary selection options, users can tailor current measurement to suit specific site requirements, enhancing accuracy and efficiency.; Automatic detection and correction of CT polarity in 2 quadrant mode ensure seamless operation and minimise the risk of errors, promoting consistent performance.",
    "Image_Path": "/LK/lk_ea_products/images/ETASMART.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/APFC_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/mcb-rccb-distribution-boards/miniature-circuit-breaker-mcb/exora",
    "Brand": "Lauritz Knudsen",
    "Type": "MCB, RCCB & DISTRIBUTION BOARDS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Exora",
    "Product_Type": "Miniature Circuit Breaker - Mcb",
    "Full_Description": "Protection and Control devices offered in this range provide safety at your home and at your workplace. It encompasses a suite of devices designed to safeguard your home against potential risks, ensuring peace of mind for you and your family.",
    "Short_Description": "Protection and Control devices offered in this range provide safety at your home and at your workplace. Low Watt loss of these products reduces the amount of electricity consumed and results in low electricity expense. The new range of Modular Devices – EXORA –ensures a safe environment around you.",
    "Benefits": "MCB is the best option to use for the protection of wiring installations against short-circuits and over-load with lots of advantages over regular Fuse unit.; It is a protection device to safeguard both your Life and Valuable Property.",
    "Image_Path": "/LK/lk_ea_products/images/Exora.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Exora_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/mcb-rccb-distribution-boards/miniature-circuit-breaker-mcb/au",
    "Brand": "Lauritz Knudsen",
    "Type": "MCB, RCCB & DISTRIBUTION BOARDS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "AU",
    "Product_Type": "Miniature Circuit Breaker - Mcb",
    "Full_Description": "Protection and Control devices offered in this range provide safety at your home and at your workplace. It encompasses a suite of devices designed to safeguard your home against potential risks, ensuring peace of mind for you and your family.",
    "Short_Description": "AU Solutions comprises protection, control, and monitoring devices crafted from accumulated knowledge. From safeguarding against overload and earth leakage to handling lightning and switching surges, this collection exceeds expectations, catering to both current and future needs.",
    "Benefits": "Providing protection against overload and short-circuit faults.; The AU range of MCBs is designed to offer the lowest watt loss in the industry. This conserves power and helps you save much more than money.",
    "Image_Path": "/LK/lk_ea_products/images/AU.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/AU-MCB,RCCB,RCBO_Catalouge.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/mcb-rccb-distribution-boards/residual-current-operated-circuit-breaker-rcbo/au",
    "Brand": "Lauritz Knudsen",
    "Type": "MCB, RCCB & DISTRIBUTION BOARDS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "AU",
    "Product_Type": "Residual Current Operated Circuit Breaker - Rcbo",
    "Full_Description": "As India's leading manufacturer of low-voltage and medium-voltage switchgear for industries, buildings, homes and agriculture segments; we offer more than expected – meeting your needs of today and tomorrow.",
    "Short_Description": "As India's leading manufacturer of low-voltage and medium-voltage switchgear for industries, buildings, homes and agriculture segments; we offer more than expected – meeting your needs of today and tomorrow.",
    "Image_Path": "/LK/lk_ea_products/images/AU.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/AU-MCB,RCCB,RCBO_Catalouge.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/mcb-rccb-distribution-boards/residual-current-circuit-breaker-rccb/exora",
    "Brand": "Lauritz Knudsen",
    "Type": "MCB, RCCB & DISTRIBUTION BOARDS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Exora",
    "Product_Type": "Residual Current Circuit Breaker - Rccb",
    "Full_Description": "Protection and Control devices offered in this range provide safety at your home and at your workplace. Low Watt loss of these products reduces the amount of electricity consumed and results in low electricity expenses. Features such as Biconnected and Two Position DIN Clip provide flexibility and ease of operation. Spanning from shielding against overloads and earth leakage to countering lightning and switching surges, this assortment surpasses expectations, catering to both current and future requirements.",
    "Short_Description": "Protection and Control devices offered in this range provide safety at your home and at your workplace. Low Watt loss of these products reduces the amount of electricity consumed and results in low electricity expenses. Features such as Biconnected and Two Position DIN Clip provide flexibility and ease of operation.",
    "Benefits": "Residual Current Circuit Breakers provide protection against earth leakage fault.; They ensure safety of human life in case of earth leakage fault and protection against electric shock.",
    "Image_Path": "/LK/lk_ea_products/images/Exora.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Exora_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/mcb-rccb-distribution-boards/1phase-3phase-automatic-changeover-with-current-limiter-accl/au",
    "Brand": "Lauritz Knudsen",
    "Type": "MCB, RCCB & DISTRIBUTION BOARDS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "AU",
    "Product_Type": "1Phase & 3Phase Automatic Changeover With Current Limiter - Accl",
    "Full_Description": "Protection and Control devices offered in this range provide safety at your home and at your workplace. It encompasses a suite of devices designed to safeguard your home against potential risks, ensuring peace of mind for you and your family.",
    "Short_Description": "Lauritz Knudsen Electrical and Automation stands as India's foremost producer of low and medium-voltage switchgear for industrial, commercial, residential, and agricultural applications. From the beginning, we have attentively listened to, observed, and understood our customers' requirements. This insight has led to the creation of AU Solutions, a comprehensive range of devices for protection, control, and monitoring. From protection against overload and earth leakage to lightning and switching surges, this range offers more than expected – meeting your needs of today and tomorrow.",
    "Benefits": "Ideal for efficient power distribution in high-rise apartments, townships, and commercial buildings.; Three pairs of terminals: two for connecting single-phase supplies (main and backup) and one for connecting the single-phase load.; Switches the load to backup/generator supply when the main/default supply fails.; Automatically reverts to the default supply upon its resumption for seamless power management.",
    "Image_Path": "/LK/lk_ea_products/images/AU.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/AU-MCB,RCCB,RCBO_Catalouge.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/mcb-rccb-distribution-boards/modular-contactor/au",
    "Brand": "Lauritz Knudsen",
    "Type": "MCB, RCCB & DISTRIBUTION BOARDS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "AU",
    "Product_Type": "Modular Contactor",
    "Full_Description": "AU Solutions is a range of protection, control and monitoring devices born from the learning gained. From protection against overload and earth leakage to lightning and switching surges, this range offers more than expected – meeting your needs of today and tomorrow.",
    "Short_Description": "AU Solutions is a range of protection, control and monitoring devices born from the learning gained. From protection against overload and earth leakage to lightning and switching surges, this range offers more than expected – meeting your needs of today and tomorrow.",
    "Image_Path": "/LK/lk_ea_products/images/AU.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/AU-MCB,RCCB,RCBO_Catalouge.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/mcb-rccb-distribution-boards/surge-protective-devices-spd/au",
    "Brand": "Lauritz Knudsen",
    "Type": "MCB, RCCB & DISTRIBUTION BOARDS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "AU",
    "Product_Type": "Surge Protective Devices - Spd",
    "Full_Description": "AU Solutions is a range of protection, control and monitoring devices born from the learning gained. From protection against overload and earth leakage to lightning and switching surges, this range offers more than expected – meeting your needs of today and tomorrow.",
    "Short_Description": "AU Solutions is a range of protection, control and monitoring devices born from the learning gained. From protection against overload and earth leakage to lightning and switching surges, this range offers more than expected – meeting your needs of today and tomorrow.",
    "Benefits": "SPDs provide protection to electrical/electronic equipment against a brief overvoltage spike or disturbance on a power/signal waveform called a surge.; The AU Solutions range of SPDs provides protection against lightning and switching surges.",
    "Image_Path": "/LK/lk_ea_products/images/AU.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/AU-MCB,RCCB,RCBO_Catalouge.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/mcb-rccb-distribution-boards/isolators/exora",
    "Brand": "Lauritz Knudsen",
    "Type": "MCB, RCCB & DISTRIBUTION BOARDS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Exora",
    "Product_Type": "Isolators",
    "Full_Description": "Lauritz Knudsen Electrical and Automation is India's leading manufacturer of low-voltage and medium-voltage switchgear for industries, buildings, homes and agriculture segments. Since the start of our journey, we have listened, observed and experienced our customers' needs. Salient features of this range – Quick Break Mechanism, True Contact Position Indicator, Energy Limitation Class 3 – enhance safety of human lives and precious belongings. Further, Low Watt loss of these products reduces the amount of electricity consumed and results in low electricity expense.",
    "Short_Description": "Our new range of Modular Devices – EXORA – ensure a safe environment around you. Protection and Control devices offered in this range provide safety at your home and at your workplace. Salient features of this range – Quick Break Mechanism, True Contact Position Indicator, Energy Limitation Class 3 – enhance safety of human lives and precious belongings. Further, Low Watt loss of these products reduces the amount of electricity consumed and results in low electricity expense.",
    "Benefits": "The isolator ensures that the circuit is entirely isolated, meaning no current can reach the load side when the isolator is turned OFF. This provides a high level of safety and prevents any unintended electrical flow, even if there is an impulse voltage.; Isolators are designed to make, carry, and break circuit current, allowing them to handle various electrical states. This versatility makes them essential for managing electrical installations and ensuring safe operation under different conditions.",
    "Image_Path": "/LK/lk_ea_products/images/Exora.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Exora_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/pump-starters-and-controllers/starter/mk-starter",
    "Brand": "Lauritz Knudsen",
    "Type": "PUMP STARTERS & CONTROLLERS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "MK Starter",
    "Product_Type": "Starter",
    "Full_Description": "Since 1960, Lauritz Knudsen Electrical & Automation has been catering to the agriculture, domestic & industrial sectors with a wide range of low motor protection solutions for pumps that help in reliable and efficient irrigation & water management. Our wide range of Direct On-Line (DOL) Starter, Star-Delta Starters, Single Phase & Three Phase variants are the ideal choice for agricultural pumping applications. Available for up to 35 HP pumps, the starters are designed to operate agriculture motors efficiently while offering reliable protection. The 3 phase Starters along with SPPR (single phasing protection relay) provide overload protection, protection from phase unbalance, single phasing, and phase reversal failures. The compact enclosure protects against dust, humidity and insects and is suitable for hot and humid environments. Easy to connect and operate, our Motor Starters are widely acceptable among farmers, industrial owners for individual pumping systems.",
    "Short_Description": "Lauritz Knudsen Electrical & Automation began its legacy 70 years ago with the introduction of MK Starters, a cornerstone of reliability in motor control technology. To date, the brand has sold over 25 million units, a testament to the enduring trust and satisfaction of its customers. These starters have been designed to meet the demands of both Direct Online (DOL) and Star-Delta applications, ensuring versatility across a wide range of agricultural and industrial uses. The MK1 and MK2 series are distinguished by their wide-band coil operation, which enhances performance across varied voltage conditions. This feature, coupled with robust design and advanced protective mechanisms, makes MK Starters a preferred choice for ensuring optimal motor efficiency and longevity in demanding agricultural and industrial environments Available Range: MK1 Starters: Relay Range: Up to 13-22 A MK2 Starters: Relay Range: 20-32 A for higher current applications. Direct Online (DOL) Starters: Available up to 7.5hp. Star-Delta Starters: Available up to 15hp. (Offered in fully automatic and semi-automatic configurations)",
    "Key_Features": "Thermal Overload Protection: Highly effective and reliable, ensuring safe operation under various conditions.; Field Proven Starters: Demonstrated reliability and effectiveness in real-world applications.; Wide Band Coil Operation: Capable of operating across a voltage range of 200-400 V.; Reliable Performance in Adverse Conditions: Ensures stable operation in hot, humid environments and under conditions of supply voltage unbalance.; Built-In “ON & OFF” Indication: Provides clear status visibility to operators.; Protective Enclosure: Shields internal components from dust, humidity, and insects.; Compatibility with Voltage/Current Auto SPPR: Ensures seamless integration with safety and performance monitoring systems.; Connection Capability: Can be linked to a Dry Run Protection device to prevent operation under unsafe conditions.",
    "Benefits": "Ensures safe operation across various conditions- offers high reliability; Can handle wide range of voltages from 200-400 V.; The design ensures reliable performance in adverse conditions such as hot, humid environments and supply voltage unbalance.; Built-in \"ON & OFF\" indicators provide clear and immediate operational status to users.; Enhances durability and electrical conductivity for prolonged service life.; Rugged silver-tipped contacts enhance durability and electrical conductivity for prolonged service life.; The protective enclosure shields internal components from dust, humidity, and insects, enhancing longevity.",
    "Image_Path": "/LK/lk_ea_products/images/MK Starter.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Pump_Starter_and_Controller_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/pump-starters-and-controllers/controller/mr-gi-digital-single-phase-controller",
    "Brand": "Lauritz Knudsen",
    "Type": "PUMP STARTERS & CONTROLLERS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "MR-Gi Digital Single Phase Controller",
    "Product_Type": "Controller",
    "Full_Description": "Since 1960, Lauritz Knudsen Electrical & Automation has been integral to Indian agriculture and industry, offering a range of low voltage motor protection solutions. These systems ensure reliable and efficient irrigation and water management, supporting the daily needs of farmers and businesses Designed and developed in-house, our starters and controllers are the preferred choice for efficiently managing pump operations, saving both energy and time for our customers Available for both three-phase and single-phase applications, LK controllers not only protect the motor but also enhance convenience and safety for the user Featuring a robust contactor, Single Phase Preventer, and Dual Voltmeter & Ammeter, this controller offers ease of installation, configuration, and maintenance. Seamlessly integrate it with communicable devices such as the M-POWER+ / M-POWER PRO / M-POWER++ modules for effortless remote pump operation Designed for up to 75 HP pumps in three-phase applications, our controllers efficiently operate agricultural motors and provide reliable protection. They offer overload protection, safeguard against phase unbalance, single phasing, and phase reversal failures, and include an auto-reset feature",
    "Short_Description": "The Digital single-phase controller is offered in three distinct variants to cater to a range of needs: MR-Gi, MR-GiA, and MR-GiB. The MR-Gi model is the manual version, designed for users who prefer control over the basic functions of their system. On the other hand, the MR-GiA and MR-GiB are equipped with automatic functionalities, enhancing convenience and efficiency. The MR-GiA variant is particularly advanced, featuring an in-built Water Level Controller (WLC) that automates water management. In contrast, the MR-GiB does not include a WLC, offering a simpler automatic option for users who do not require this feature. All variants are equipped with an automatic load setting and a digital display that provides critical real-time data on various operational parameters such as voltage and current. This feature allows for better monitoring and management of the controller's performance, ensuring optimal functionality and helping to prevent issues related to electrical parameters. Whether for residential, commercial, or agricultural use, each controller variant is designed to offer tailored solutions, ensuring users have the right tools for efficient management of their single-phase systems. Range Available: ﻿ 0.5 HP to 3 HP (Single Phase Applications Only)",
    "Key_Features": "Features: MR-Gi Manual version; Microcontroller Based Solution: Ensures precise control and monitoring.; Complete Protection: Guards against dry run, under-voltage, and over-voltage.; Current and Voltage Metering: Allows for detailed monitoring of electrical parameters.; Bypass Mode: Enables manual operation of the system.; Off Timer: Can controls the operational duration.; Digital Display: Provides real-time feedback on system status.; Automatic Current Setting: Adjusts electrical current automatically.; Capacitor Cut-off: Extends the life of capacitors.; Water Tank Status Indication: Indicates water level status to prevent overfill or depletion.",
    "Benefits": "Manual mode provides direct control over the system, allowing users to adjust settings based on immediate needs or changes in conditions.; It enables operators to engage directly with the system, offering opportunities for hands-on troubleshooting and fine-tuning.; Automatic mode simplifies operations by managing routine tasks through pre-set controls, reducing the need for constant human intervention.; It enhances consistency in operations by maintaining optimal conditions automatically, minimizing the risk of human error.; Features like the inbuilt Water Level Controller automate water management, ensuring efficient use of resources and prevention of issues such as overflows or dry running.; Timers and delay functions in automatic mode help maintain a schedule, protect equipment, and conserve energy by running the system only when necessary.",
    "Image_Path": "/LK/lk_ea_products/images/MR-Gi Digital Single Phase Controller.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/MRGi_Controller_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/pump-starters-and-controllers/solar-solutions/solar-drive-controller",
    "Brand": "Lauritz Knudsen",
    "Type": "PUMP STARTERS & CONTROLLERS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Solar Drive Controller",
    "Product_Type": "Solar Solutions",
    "Full_Description": "Lauritz Knudsen offers cutting-edge solar solutions with its Solar Drive Controller (Px3000), designed to power three-phase Submersible and Monoblock Pumps/Motors for a variety of applications, including irrigation, water supply, farm tank filling, and industrial activities. This robust controller features true MPPT (Maximum Power Point Tracking) to optimise performance even under cloudy conditions, ensuring maximum power extraction from PV panels. It automatically adjusts to changes in current and voltage to maximise output. With its dual supply capability, the Px3000 can operate on both solar and grid power, providing cost savings during daylight hours. Capable of handling input DC voltages up to 850V and operating at temperatures up to 50 degrees Celsius without derating, this controller sets the standard for reliability and efficiency in solar-powered water management",
    "Short_Description": "The Solar Drive Controller (Px3000) offers a robust and intuitive solution tailored to enhance the performance of three-phase submersible and monoblock pump motors across a wide range of applications, including irrigation, water supply, tank filling, and various industrial activities. Featuring advanced true Maximum Power Point Tracking (MPPT) technology, the Px3000 is engineered to optimize the efficiency of solar energy conversion, ensuring that pumps operate at peak performance even under varying solar conditions. Its plug-and-play design simplifies installation, allowing for immediate operation without the need for extensive setup. In addition to its powerful MPPT capability, the Px3000 is adept at functioning in less than ideal solar conditions, such as cloudy weather, ensuring that the maximum possible power is extracted from the photovoltaic (PV) panels at all times. This auto-adjustable feature dynamically alters current and voltage parameters to maximize output, enhancing overall energy efficiency. The dual supply capability of the controller allows it to switch seamlessly between solar and grid power, providing cost-effective operation by leveraging solar power during daylight hours. Furthermore, the controller's ability to operate at temperatures up to 50 degrees Celsius without any derating exemplifies its suitability for challenging environments, ensuring reliable performance regardless of external conditions. Range Available:",
    "Key_Features": "True MPPT Technology: Maximizes water output during the day by optimally converting solar energy into usable power.; Automatic Operation: Automatically starts and stops the pump based on the intensity of sunlight, enhancing energy efficiency.; Dual Energy Compatibility: Operates seamlessly using either solar power or grid electricity, offering flexibility in energy sourcing.; Reverse Polarity Protection: Equipped with a feature that allows the motor to run correctly even if the PV wires are connected to opposite polarity terminals, preventing potential damage.; Plug & Play Installation: Simplifies setup with easy installation; automatically detects and sets necessary parameters like Vmp and Voc without manual input.; Robust Design: Capable of handling very high input DC voltages up to 850V, making it suitable for a wide range of solar applications.",
    "Benefits": "True MPPT technology ensures that you get the most efficient use of solar energy throughout the day, maximising water output and reducing energy waste.; The controller's ability to automatically start and stop the pump based on sunlight intensity optimises energy use and prolongs the lifespan of the pump.; Dual energy compatibility provides the flexibility to switch between solar and grid power, ensuring reliable operation regardless of weather conditions and reducing dependency on non-renewable energy sources.; Reverse polarity protection safeguards the motor from installation errors, enhancing the system's reliability and reducing the risk of damage due to incorrect wiring.; The plug and play feature eliminates the need for manual parameter configuration, facilitating quick and easy setup that saves time and minimises setup errors.; A robust design capable of handling high input voltages up to 850V ensures the system can cope with variable solar intensities and maintain stable operation under diverse environmental conditions.",
    "Image_Path": "/LK/lk_ea_products/images/Solar Drive Controller.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Px3000_Solar_Drive_Catalogues.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/time-switches/astro",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Astro",
    "Product_Type": "Time Switches",
    "Full_Description": "Time Switches are used for fixed time daily / weekly applications. They are ideal for lighting applications and also used to control air-conditioners / coolers, geysers, conveyers, pumps and exhaust fans etc.",
    "Short_Description": "An Astronomical Time Switch adjusts switching times automatically based on sunrise and sunset data for your location. It eliminates the need for seasonal reprogramming, making it ideal for outdoor lighting, signage, and security systems that require consistent operation year-round.",
    "Image_Path": "/LK/lk_ea_products/images/Astro.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Panel_Accessories_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/push-buttons-indicating-lamps/gen-next-pro-22.5-mm",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Gen next pro 22.5 mm",
    "Product_Type": "Push Buttons Indicating Lamps",
    "Full_Description": "Remote control units play a crucial role on factory shop floor for operational safety and reliability. Reliable push buttons and indicators have been trusted by users across industries for over 4 decades.",
    "Short_Description": "The 22.5mm Indicator is a panel-mounted visual device used to display the operational status of electrical circuits. Its larger size ensures high visibility, making it ideal for industrial control panels. Available in multiple colors, it supports quick status identification and enhances safety.",
    "Image_Path": "/LK/lk_ea_products/images/Gen next pro 22.5 mm.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Panel_Accessories_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/push-buttons-indicating-lamps/gen-next-pro-16-mm",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Gen next pro 16 mm",
    "Product_Type": "Push Buttons Indicating Lamps",
    "Full_Description": "Remote control units play a crucial role on factory shop floor for operational safety and reliability. Reliable push buttons and indicators have been trusted by users across industries for over 4 decades.",
    "Short_Description": "The 16mm Indicator is a compact signaling device designed for space-constrained panels and enclosures. Despite its small footprint, it offers clear visual indication of circuit status. Suitable for instrumentation, control systems, and compact machinery.",
    "Image_Path": "/LK/lk_ea_products/images/Gen next pro 16 mm.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Panel_Accessories_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/push-buttons-indicating-lamps/push-button-metal",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Push button metal",
    "Product_Type": "Push Buttons Indicating Lamps",
    "Full_Description": "Remote control units play a crucial role on factory shop floor for operational safety and reliability. Reliable push buttons and indicators have been trusted by users across industries for over 4 decades.",
    "Short_Description": "Metal Push Buttons provide a rugged and durable interface for demanding environments. Offered in illuminated and non-illuminated types, they combine strength with functionality. Ideal for industrial machinery, outdoor panels, and high-usage areas.",
    "Image_Path": "/LK/lk_ea_products/images/Push button metal.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Panel_Accessories_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/push-buttons-indicating-lamps/buzzer",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Buzzer",
    "Product_Type": "Push Buttons Indicating Lamps",
    "Full_Description": "Remote control units play a crucial role on factory shop floor for operational safety and reliability. Reliable push buttons and indicators have been trusted by users across industries for over 4 decades.",
    "Short_Description": "The Buzzer is an audible alert device used to signal warnings, faults, or operational status. It produces a clear sound output, ensuring quick attention in control panels and alarm systems. Suitable for safety circuits and monitoring applications.",
    "Image_Path": "/LK/lk_ea_products/images/Buzzer.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Panel_Accessories_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/push-buttons-indicating-lamps/push-button-stations",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Downloaded",
    "Downloaded_Documents": [],
    "Name": "Push button stations",
    "Product_Type": "Push Buttons Indicating Lamps",
    "Full_Description": "Remote control units play a crucial role on factory shop floor for operational safety and reliability. Reliable push buttons and indicators have been trusted by users across industries for over 4 decades.",
    "Short_Description": "A Push Button Station is a pre-assembled unit housing one or more push buttons for manual control. It simplifies installation and operation for start/stop and emergency functions. Commonly used in industrial setups, machinery, and process control systems",
    "Image_Path": "/LK/lk_ea_products/images/Push button stations.jpg",
    "Brochure_Path": "/LK/lk_ea_products/brochures/Panel_Accessories_Catalogue.pdf"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/medium-voltage/vacuum-contactor-units-vcu/vcu7",
    "Brand": "Lauritz Knudsen",
    "Type": "MEDIUM VOLTAGE",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "VCU7",
    "Product_Type": "Vacuum Contactor Units - Vcu",
    "Full_Description": "The Lauritz Knudsen Electrical & Automation VCU stands out as the definitive choice for medium voltage switching applications, boasting suitability for system voltages up to 12kV and short circuit capacities up to 40kA, all with HRC fuse protection. Its features include fused short circuit protection up to 40kA, availability in latched and non-latched configurations, encapsulated current carrying parts for heightened safety, and a truck-mounted design reminiscent of VCBs. Moreover, it proves ideal for motor starters requiring numerous switching operations, and its VCU panels seamlessly couple with VCB panels due to their similar dimensions. This amalgamation of robust features makes the Lauritz Knudsen VCU a versatile and reliable solution for various electrical system needs.",
    "Short_Description": "The VCU7 meets the specifications outlined in the IEC Standard. Vacuum contactors find primary use in medium voltage switchboards, particularly in demanding scenarios like motor starting operations, as well as within industries such as Industrial, Mining, Metal, and Oil & Gas sectors.",
    "Image_Path": "/LK/lk_ea_products/images/VCU7.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/medium-voltage/e-house/e-house",
    "Brand": "Lauritz Knudsen",
    "Type": "MEDIUM VOLTAGE",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "E-House",
    "Product_Type": "E-House",
    "Full_Description": "Lauritz Knudsen provides the best quality power solutions to its customers. Our specialized know how and global experience over the years have helped us to construct and commission substations as per Customer's needs. E-House is a Pre-Fabricated Electrical Substation building, customized to house all Electrical Equipment as per project requirement.",
    "Short_Description": "Lauritz Knudsen provides the best quality power solutions to its customers. Our specialized know how and global experience over the years have helped us to construct and commission substations as per Customer's needs. E-House is a Prefabricated Electrical Substation building, customized to house all Electrical Equipment as per project requirement.",
    "Image_Path": "/LK/lk_ea_products/images/E-House.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/lv-iec-panels/pcc-and-mcc-panels/t-era",
    "Brand": "Lauritz Knudsen",
    "Type": "LV IEC PANELS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "T-ERA",
    "Product_Type": "Pcc And Mcc Panels",
    "Full_Description": "Lauritz Knudsen is a leader in low-voltage electrical switchboards, delivering IEC-certified solutions that blend technical expertise, safety, and innovation. Built to meet global standards, Lauritz Knudsen switchboards are essential to modern & digital electrical distribution systems, ensuring reliable power flow across factories, infrastructure, and specialized industrial applications. Each unit is engineered for optimal performance, offering safe switching, metering, and circuit protection, with the flexibility to be customized for diverse operational needs. Featuring robust enclosures and precision-built components, Lauritz Knudsen switchboards enable efficient energy management, helping facilities operate with greater confidence, control, digitalization and sustainability.",
    "Short_Description": "T-ERA, a testament to sustainability, reliability, and safety, is crafted with decades of engineering excellence. Its range of low voltage switchgear meets international standards and quality, ensuring the safety of your applications while maximising space efficiency and minimising hazards. T-ERA not only saves you time and energy but also enhances cost optimisation. As the eco-friendly choice across a variety of applications, T-ERA leads the way in responsible technology.",
    "Benefits": "T-ERA offers advanced technology today, ensuring adaptability to future needs in safety, sustainability, and digital integration.; Built with top-notch engineering, T-ERA exceeds safety standards, providing dependable performance for peace of mind.; T-ERA's compact and efficient design maximises space utilisation without compromising functionality.; With withdrawable modules and advanced monitoring systems, T-ERA minimises downtime and reduces operational costs.",
    "Image_Path": "/LK/lk_ea_products/images/T-ERA.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/motor-management-control/over-load-relay-olr/mn-relay",
    "Brand": "Lauritz Knudsen",
    "Type": "MOTOR MANAGEMENT & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "MN Relay",
    "Product_Type": "Over Load Relay - Olr",
    "Full_Description": "Lauritz Knudsen Electrical & Automation overload relays are protection devices required in various motor starter combinations. Lauritz Knudsen Electrical & Automation range of contactors complements the range of thermal overload relays. These are available for various DOL/ Star delta combinations. The overload relays have a built-in sensitive mechanism that protects the motor from overload and single phasing",
    "Short_Description": "MN Thermal Overload Relays, ranging from 0.2A to 570A, complement the MNX series of power contactors. These relays are compensated for ambient temperature, and their distinctive double slide mechanism ensures dependable protection against single phasing. MN 12L relays, with a trip class of 30, are specifically designed for applications with extended starting times.",
    "Benefits": "Provides flexibility with manual and auto reset modes.; Offers enhanced safety with built-in single phasing protection.; Features Trip Class 30 in MN 12L relays, ideal for long starting applications.",
    "Image_Path": "/LK/lk_ea_products/images/MN Relay.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/motor-management-control/over-load-relay-olr/rto-relay",
    "Brand": "Lauritz Knudsen",
    "Type": "MOTOR MANAGEMENT & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "RTO Relay",
    "Product_Type": "Over Load Relay Olr",
    "Full_Description": "Lauritz Knudsen Electrical & Automation overload relays are protection devices required in various motor starter combinations. Lauritz Knudsen Electrical & Automation range of contactors complements the range of thermal overload relays. These are available for various DOL/ Star delta combinations. The overload relays have a built-in sensitive mechanism that protects the motor from overload and single phasing",
    "Short_Description": "RTO Thermal Overload Relays complement the MO range of contactors and can be directly mounted onto them. The relays are compensated for ambient temperature and are sensitive to phase failure. They feature front access to START and STOP/RESET buttons and are equipped with three contacts for Alarm, Trip, and Start functions.",
    "Benefits": "Direct mounting on MO contactors simplifies installation.; Visual status indication (tripped/non-tripped) visible from the front enhances monitoring.; Front access to terminals for easy wiring streamlines installation.; Separate mounting facility available for flexibility.; Auto/manual reset function offers versatile reset options",
    "Image_Path": "/LK/lk_ea_products/images/RTO Relay.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/motor-management-control/over-load-relay-olr/eolr",
    "Brand": "Lauritz Knudsen",
    "Type": "MOTOR MANAGEMENT & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "EOLR",
    "Product_Type": "Over Load Relay Olr",
    "Full_Description": "Lauritz Knudsen Electrical & Automation overload relays are protection devices required in various motor starter combinations. Lauritz Knudsen Electrical & Automation range of contactors complements the range of thermal overload relays. These are available for various DOL/ Star delta combinations. The overload relays have a built-in sensitive mechanism that protects the motor from overload and single phasing",
    "Short_Description": "The REO Electronic Overload Relays are designed to seamlessly integrate with the MO series of contactors, allowing for direct mounting. These relays are sensitive to phase failure and can additionally offer ground fault protection as well as locked rotor protection. Featuring convenient front access, they come equipped with START and STOP/RESET buttons. Furthermore, each relay includes three contacts for Alarm, Trip, and Start functions.",
    "Benefits": "Mount directly onto MO contactors for easy installation.; Clear trip indication through mechanical flag and LED flash.; Separate mounting option provides flexibility in placement.; Convenient test function simulates relay tripping from the front.",
    "Image_Path": "/LK/lk_ea_products/images/EOLR.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/ac-drive/nx2000-plus",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Nx2000+",
    "Product_Type": "Ac Drive",
    "Full_Description": "With over four decades of engineering excellence, Lauritz Knudsen presents the xD Series AC Drives. This product, part of our Industrial Automation portfolio, goes beyond technology. It is engineered to deliver efficiency, reliability, and control. Whether you're managing HVAC systems, water treatment facilities, manufacturing lines, or process automation setups, the xD Series is designed to optimize motor control and enhance energy efficiency across a wide range of industrial applications.",
    "Short_Description": "Building on the success of its predecessor, the Nx2000+ drives represent a significant leap forward in motor control and power management. These drives feature advanced sensorless vector control and intuitive user interfaces, providing unparalleled precision, reliability, and efficiency in regulating electric motors across a broad spectrum of industrial applications. Enhanced features allow for meticulous power adjustments, ensuring optimal motor performance with minimal energy waste. LK's longstanding commitment to innovation is evident in the design and capabilities of the Nx2000+ AC drives. With decades of expertise behind them, these drives empower industries to reach peak performance levels, optimise energy usage, and contribute to a sustainable future. The combination of cutting-edge technology and user-focused design makes the Nx2000+ a key tool for industries aiming to enhance their operational efficiency and environmental stewardship.",
    "Benefits": "DIN rail mounting available up to 4kW provides flexible and space-efficient installation options that simplify integration into a variety of settings.; The two relay outputs offer increased control flexibility, allowing for more complex operations and automation setups.; The dual port Ethernet option enhances network connectivity, enabling seamless integration and communication between devices.; The remote expansion keypad allows for convenient operation and system adjustments from a distance, improving accessibility and user comfort.; The integrated EMC filter minimises electromagnetic interference, ensuring stable and reliable operation across a range of industrial environments.",
    "Image_Path": "/LK/lk_ea_products/images/Nx2000+.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/soft-starters/csx",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "CSX (Discontinued)",
    "Product_Type": "Soft Starters",
    "Full_Description": "LK-EA provides a variety of soft starters engineered to manage the starting and stopping of induction motors. These soft starters minimise mechanical stress on both the motor and the connected equipment, ensuring smoother operation and prolonging the lifespan of the machinery. Additionally, they offer motor protection, advanced communication options, and energy-saving features. LK's soft starters are perfect for diverse industrial applications, delivering dependable and efficient motor control solutions.",
    "Short_Description": "The CSX Soft Starter provides a controlled solution for the starting and stopping of induction motors. It ensures seamless integration, advanced motor protection, and easy operation with its user-friendly interface. Featuring a compact design and comprehensive functionality, the CSX Soft Starter is ideal for various industrial applications, delivering reliable and energy-efficient motor control. Its durable construction and advanced features make it an excellent choice for optimizing motor performance and improving operational efficiency.",
    "Benefits": "Enhanced motor longevity through comprehensive protection features.; Improved operational efficiency with smooth start/stop functions and adjustable current limits.; Increased safety from advanced mechanisms guarding against electrical issues.; Easy integration and control via built-in communication and PC interface options.",
    "Image_Path": "/LK/lk_ea_products/images/CSX (Discontinued).jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/soft-starters/emx4i",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "EMX4i (Discontinued)",
    "Product_Type": "Soft Starters",
    "Full_Description": "LK-EA provides a variety of soft starters engineered to manage the starting and stopping of induction motors. These soft starters minimise mechanical stress on both the motor and the connected equipment, ensuring smoother operation and prolonging the lifespan of the machinery. Additionally, they offer motor protection, advanced communication options, and energy-saving features. LK's soft starters are perfect for diverse industrial applications, delivering dependable and efficient motor control solutions.",
    "Short_Description": "The EMX4i Soft Starter is crafted to deliver seamless and efficient control for induction motors. It features integrated bypass, built-in motor protection, and a user-friendly interface, making it ideal for diverse industrial applications. Additionally, the EMX4i Soft Starter includes advanced communication options, energy optimization capabilities, and robust construction, ensuring reliable and smooth motor operations while reducing wear and tear. With its comprehensive features, the EMX4i Soft Starter is a premier choice for optimizing motor performance and achieving operational excellence.",
    "Benefits": "Efficient motor operation and reduced energy loss with built-in bypass contactor.; Simplified maintenance and reduced downtime thanks to screw-less design.; Quick setup and easy data retrieval via USB port.; Enhanced user experience with a full graphical display and multi-language support.",
    "Image_Path": "/LK/lk_ea_products/images/EMX4i (Discontinued).jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/plc/xp3000-and-xp5000",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "xP3000 and xP5000",
    "Product_Type": "Programmable Logic Controller - Plc",
    "Full_Description": "Welcome to Our xP Series all PLC Range Discover the power and versatility of our xP Series PLC range, designed to meet the automation needs of modern industries. Our compact and efficient PLCs offer robust performance, easy integration, and exceptional reliability, making them the perfect choice for a wide variety of applications. Key Features: Whether you're looking to automate a small machine or mid performance automation task our xP Series PLC range provides the flexibility and control you need to enhance productivity and efficiency. Explore our products today and take the first step towards smarter automation.",
    "Short_Description": "Welcome to Our xP Series all PLC Range. Discover the power and versatility of our xP Series PLC range, designed to meet the automation needs of modern industries. Our compact and efficient PLCs offer robust performance, easy integration, and exceptional reliability, making them the perfect choice for a wide variety of applications.",
    "Benefits": "Compact Design: Ideal for space-constrained environments without compromising on functionality.; High Performance: Fast processing speeds and advanced control capabilities ensure optimal operation.; User-Friendly Interface: Simplified programming and configuration for quick and easy setup.; Scalability: Easily expandable to accommodate growing automation requirements.; Durability: Built to withstand harsh industrial conditions, ensuring long-term reliability.",
    "Image_Path": "/LK/lk_ea_products/images/xP3000 and xP5000.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/plc/xp1000",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "xP1000",
    "Product_Type": "Programmable Logic Controller - Plc",
    "Full_Description": "Welcome to Our xP Series all PLC Range Discover the power and versatility of our xP Series PLC range, designed to meet the automation needs of modern industries. Our compact and efficient PLCs offer robust performance, easy integration, and exceptional reliability, making them the perfect choice for a wide variety of applications. Key Features: Whether you're looking to automate a small machine or mid performance automation task our xP Series PLC range provides the flexibility and control you need to enhance productivity and efficiency. Explore our products today and take the first step towards smarter automation.",
    "Short_Description": "Welcome to Our xP Series all PLC Range. Discover the power and versatility of our xP Series PLC range, designed to meet the automation needs of modern industries. Our compact and efficient PLCs offer robust performance, easy integration, and exceptional reliability, making them the perfect choice for a wide variety of applications.",
    "Benefits": "Compact Design: Ideal for space-constrained environments without compromising on functionality.; High Performance: Fast processing speeds and advanced control capabilities ensure optimal operation.; User-Friendly Interface: Simplified programming and configuration for quick and easy setup.; Scalability: Easily expandable to accommodate growing automation requirements.; Durability: Built to withstand harsh industrial conditions, ensuring long-term reliability.",
    "Image_Path": "/LK/lk_ea_products/images/xP1000.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/human-machine-interface-hmi/xt1000",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "XT1000",
    "Product_Type": "Human-Machine Interface - Hmi",
    "Full_Description": "The XT series HMIs (Human Machine Interfaces) is a cutting-edge solution designed to enhance the visualisation and control of machines and industrial processes within a plant. Integrating the latest hardware and software technologies, these HMIs come equipped with user-friendly software featuring pre-built graphics, industry symbols, and programming blocks. This enables users to create intuitive graphical interfaces swiftly and efficiently for various demanding applications, including machine, factory, process, and building/home automation.",
    "Short_Description": "The XT series HMIs (Human Machine Interfaces) is a cutting-edge solution designed to enhance the visualisation and control of machines and industrial processes within a plant. Integrating the latest hardware and software technologies, these HMIs come equipped with user-friendly software featuring pre-built graphics, industry symbols, and programming blocks. This enables users to create intuitive graphical interfaces swiftly and efficiently for various demanding applications, including machine, factory, process, and building/home automation.",
    "Benefits": "Increased efficiency by reducing time and effort required to develop HMI applications.; Seamless integration with existing systems and devices due to extensive connectivity options.; Enhanced automation capabilities through advanced features like datalogging and custom scripting.",
    "Image_Path": "/LK/lk_ea_products/images/XT1000.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/human-machine-interface-hmi/xte6000-and-xts6000",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "xTE6000 and xTS6000",
    "Product_Type": "Human-Machine Interface - Hmi",
    "Full_Description": "The XT series HMIs (Human Machine Interfaces) is a cutting-edge solution designed to enhance the visualisation and control of machines and industrial processes within a plant. Integrating the latest hardware and software technologies, these HMIs come equipped with user-friendly software featuring pre-built graphics, industry symbols, and programming blocks. This enables users to create intuitive graphical interfaces swiftly and efficiently for various demanding applications, including machine, factory, process, and building/home automation.",
    "Short_Description": "The XT series HMIs (Human Machine Interfaces) is a cutting-edge solution designed to enhance the visualisation and control of machines and industrial processes within a plant. Integrating the latest hardware and software technologies, these HMIs come equipped with user-friendly software featuring pre-built graphics, industry symbols, and programming blocks. This enables users to create intuitive graphical interfaces swiftly and efficiently for various demanding applications, including machine, factory, process, and building/home automation.",
    "Benefits": "Increased efficiency by reducing time and effort required to develop HMI applications.; Seamless integration with existing systems and devices due to extensive connectivity options.; Enhanced automation capabilities through advanced features like datalogging and custom scripting.",
    "Image_Path": "/LK/lk_ea_products/images/xTE6000 and xTS6000.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/servo/m5",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "M5",
    "Product_Type": "Servo",
    "Full_Description": "Lauritz Knudsen Electrical and Automation's M5 Series Servo System offers high-performance motion control solutions for industrial automation, enhancing machine productivity with its high-speed, precise capabilities. The system features versatile motion control including positioning, synchronous, cam, speed, and torque control. It is equipped with smart functions such as backup, network diagnosis, and monitoring, all designed to improve efficiency. The built-in EtherCAT Interface supports 100BASE-TX real-time communication, precise synchronisation, and easy connectivity with standard RJ45 cabling, making it an optimal choice for general-purpose machine control applications.",
    "Short_Description": "The M5 Series Servo System by Lauritz Knudsen Electrical and Automation offers high-speed, high-precision control through pulse/analog or EtherCAT network options. With IP65 protection and optional features like oil seals and brakes, it ensures robust performance. Embedded position controls with up to 64 index tables provide versatile positioning options, while the built-in EtherCAT Interface enables 100BASE-TX Ethernet communication with real-time capabilities and precise synchronisation. Additional features include Modbus RTU Protocol for parameter management and intelligent controls such as notch filters for resonance suppression and FFT function for frequency analysis. Easy to configure and use, the system includes a PC tool for setup and tuning, automatic inertia estimation for simplified gain tuning, and a rotary switch for drive node address configuration. CE certified, the M5 Series meets international safety standards. ",
    "Benefits": "High-speed, high-precision control improves machine performance and efficiency.;Multiple control options and robust protection features suit various industrial environments. Real-time frequency analysis boosts reliability.; PC tool for easy configuration, tuning, and debugging simplifies setup. ; Automatic inertia estimation and rotary switch for address configuration enhance usability. ;Advanced filters for resonance suppression and vibration control ensure optimal operation. ",
    "Key_Features":"Control Options - Supports pulse/analog or network (EtherCAT) control. ;Protection and Options - Conformal coating, IP65 rating, with optional oil seal, brake, and STO mode (in network type only). ; Embedded Position Controls - Up to 64 index tables for versatile position control through I/O combination and table configuration. ; Built-in EtherCAT Interface - 100BASE-TX Ethernet communication with real-time capabilities and precise synchronisation, supporting up to 100m between nodes.;High-Speed Position Capture - Touch Probe1 and Touch Probe2 for accurate position capture. ;Modbus RTU Protocol - RS-422 communication for parameter management through HMI.",
    "Image_Path": "/LK/lk_ea_products/images/Servo.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/gateways/tg-gateways",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "TG Gateways",
    "Product_Type": "Gateways",
    "Full_Description": "In this era of Industry 5.0 and connected products, Digitalization is driven by advancements in networking. New age communication involves the use of different protocols like MQTT, MODBUS etc, taking in account the different applications and performance that is expected out a particular field device. Taking this into consideration, several nodes can communicate directly with the Server/HMI with a gateway/converter acting as a bridge. SmartComm Edge is the range of products MQTT gateways and TCP/IP converter which helps your field devices connect with SmartComm software On-Prem/Cloud seamlessly",
    "Short_Description": "TG1000 is a MODBUS Gateway that converts MODBUS RS485 to MODBUS TCP/IP protocol i.e. from D+ and D- to Ethernet wiring standard. It bridges the communication-capable products with RS485 port with Smartcomm EMS/PMS On-prem installed in a server and thereby leading to connected and intelligent field devices.",
    "Image_Path": "/LK/lk_ea_products/images/TG Gateways.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/gateways/mq-gateways",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "MQ Gateways",
    "Product_Type": "Gateways",
    "Full_Description": "In this era of Industry 5.0 and connected products, Digitalization is driven by advancements in networking. New age communication involves the use of different protocols like MQTT, MODBUS etc, taking in account the different applications and performance that is expected out a particular field device. Taking this into consideration, several nodes can communicate directly with the Server/HMI with a gateway/converter acting as a bridge. SmartComm Edge is the range of products MQTT gateways and TCP/IP converter which helps your field devices connect with SmartComm software On-Prem/Cloud seamlessly",
    "Short_Description": "MQ1000 is an IoT Gateway that converts MODBUS RS485 to MQTT (Message Queuing Telemetry Transport) protocol i.e. from D+ and D- to Ethernet wiring standard that can be connected to Internet Router. It bridges the communication-capable products with RS485 port with Smartcomm EMS/PMS Cloud that can drive Industry 5.0 which includes Cloud and Big Data processing installed in a remote powerful cloud server and thereby leading to connected and super- intelligent field devices. MQ2000 is an MQTT Gateway that converts MODBUS RS485 to MQTT protocol i.e. from D+ and D- to Cloud (SmartComm EMS/Operate). It bridges the communication-capable products with RS485 port with Smartcomm EMS/Operate Cloud and thereby leading to IoT",
    "Image_Path": "/LK/lk_ea_products/images/MQ Gateways.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-automation-control/gateways/xr-gateways",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL AUTOMATION & CONTROL",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "XR Gateways",
    "Product_Type": "Gateways",
    "Full_Description": "In this era of Industry 5.0 and connected products, Digitalization is driven by advancements in networking. New age communication involves the use of different protocols like MQTT, MODBUS etc, taking in account the different applications and performance that is expected out a particular field device. Taking this into consideration, several nodes can communicate directly with the Server/HMI with a gateway/converter acting as a bridge. SmartComm Edge is the range of products MQTT gateways and TCP/IP converter which helps your field devices connect with SmartComm software On-Prem/Cloud seamlessly",
    "Short_Description": "The XR5000 gateway is a highly versatile, reliable edge computing LTE gateway. With most essential hardware interfaces available naively on the device, and support of Industrial protocols like Modbus and DLMS. The device is suitable for Industrial Automation / Metering applications. From seamless Sensor integration to PLC/RTU/ meter integration coupled with SmartComm Cloud, it ensures easy device setup, configuration, Device and Data Management.",
    "Image_Path": "/LK/lk_ea_products/images/XR Gateways.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/energy-management-products/digital-panel-meters/mfm",
    "Brand": "Lauritz Knudsen",
    "Type": "ENERGY MANAGEMENT PRODUCTS",
    "Image_Download_Status": "Not Found on Category Page",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "MFM",
    "Product_Type": "Digital Panel Meters",
    "Full_Description": "Digital Panel Meters play a vital role in electrical power distribution by offering real-time monitoring and display of a wide array of electrical parameters, including fundamental aspects like voltage, current, and frequency, as well as advanced parameters such as energy, demand, and power quality. They deliver precise and immediate visibility into crucial data, supporting effective decision-making, issue resolution, and maintenance activities. In industrial settings, these meters facilitate accurate measurement and regulation of electrical parameters, enhancing operational safety, energy efficiency, and overall equipment performance. With their adaptability and dependability, Digital Panel Meters are essential for streamlining processes, ensuring adherence to standards, and enabling seamless operations in all areas of electricity consumption.",
    "Short_Description": "Experience unparalleled monitoring with our Multifunction Meters, providing essential parameters and advanced load monitoring expertise. Featuring Total Harmonic Distortion (THD) measurement for Voltage and Current, these meters ensure precise power quality analysis. The inclusion of Maximum Demand measurement with a Real-Time Clock enhances their capabilities, offering detailed insights into energy consumption patterns. Additionally, the meters display phase-wise Voltage and Current waveforms on an LCD for real-time critical data visualization. Customize your display with the \"My Favorite\" screen option and take advantage of independently programmable Analog output for versatile configurations. It's the epitome of monitoring convenience and accuracy.",
    "Benefits": "Real-time and remote monitoring provides immediate visibility into electrical parameters, allowing for quick decision-making and proactive troubleshooting.; Accuracy offers precise measurement of various electrical parameters, ensuring reliable data for monitoring and control.; Versatility enables monitoring a wide range of parameters including voltage, current, power, energy, and more, making it suitable for diverse applications.; Easy integration into existing electrical systems offers flexibility and convenience.",
    "Image_Path": "/LK/lk_ea_products/images/mfm.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/energy-management-products/tariff-meter/em101+",
    "Brand": "Lauritz Knudsen",
    "Type": "ENERGY MANAGEMENT PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "EM101+",
    "Product_Type": "Tariff Meter",
    "Full_Description": "Our high accuracy meters are used by many of the largest utilities to measure and analyse bulk power flow, both in intra and inter-utility applications. These meters have been designed keeping in mind utility requirements of high accuracy over a wide power range. With a low level of current required for starting the measurement of power, these meters have become the preferred choice of utilities in monitoring and billing power flows.",
    "Short_Description": "EM101+ is compact direct connected energy meter used in domestic & commercial application in 1Ph segment. This meter is available in different current range, with no compromise on accuracy of measurement in class 1.0 segment. This is a reliable meter for 1Phase 2Wire operation with vast features set as below",
    "Image_Path": "/LK/lk_ea_products/images/EM101+.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/energy-management-products/tariff-meter/er300p",
    "Brand": "Lauritz Knudsen",
    "Type": "ENERGY MANAGEMENT PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "ER300P",
    "Product_Type": "Tariff Meter",
    "Full_Description": "Our high accuracy meters are used by many of the largest utilities to measure and analyse bulk power flow, both in intra and inter-utility applications. These meters have been designed keeping in mind utility requirements of high accuracy over a wide power range. With a low level of current required for starting the measurement of power, these meters have become the preferred choice of utilities in monitoring and billing power flows.",
    "Short_Description": "ER300P is  comprehensive range of direct connected, CT Operated & CT VT operated tri-vector Meter that integrates several functions and replaces various equipment’s for Metering energy parameters.  These meters are suitable for LT & HT applications and come in different class of accuracies. They used for domestic, commercial as well as industrial metering at various voltage levels.",
    "Image_Path": "/LK/lk_ea_products/images/ER300P.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/mcb-rccb-distribution-boards/miniature-circuit-breaker-mcb/tripper",
    "Brand": "Lauritz Knudsen",
    "Type": "MCB, RCCB & DISTRIBUTION BOARDS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Tripper",
    "Product_Type": "Miniature Circuit Breaker - Mcb",
    "Full_Description": "Protection and Control devices offered in this range provide safety at your home and at your workplace. It encompasses a suite of devices designed to safeguard your home against potential risks, ensuring peace of mind for you and your family.",
    "Short_Description": "In a place where the safety and well-being of your loved ones are paramount, the Tripper range stands out as the ideal choice. It encompasses a suite of devices designed to safeguard your home against potential risks, ensuring peace of mind for you and your family.",
    "Benefits": "MCB offers protection of wiring installations against short-circuits and over-load with lots of advantages over regular fuse unit.; It is a protection device to safeguard both your Life and Valuable Property.",
    "Image_Path": "/LK/lk_ea_products/images/Tripper.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/mcb-rccb-distribution-boards/1phase-3phase-automatic-changeover-with-current-limiter-accl/tripper",
    "Brand": "Lauritz Knudsen",
    "Type": "MCB, RCCB & DISTRIBUTION BOARDS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Tripper",
    "Product_Type": "1Phase & 3Phase Automatic Changeover With Current Limiter - Accl",
    "Full_Description": "Protection and Control devices offered in this range provide safety at your home and at your workplace. It encompasses a suite of devices designed to safeguard your home against potential risks, ensuring peace of mind for you and your family.",
    "Short_Description": "The Tripper range is a complete package for your home, ensuring that the safety of your loved ones is paramount. Designed to provide comprehensive protection and convenience, the Tripper range integrates advanced technology with user-friendly features to create a secure living environment.",
    "Key_Features": "Different LED Colours : The Tripper range includes LED indicators with distinct colours to clearly differentiate between the statuses of Mains ON, Genset ON, and Genset Overload. This visual cue ensures users can quickly and easily identify the current power state.; Reset Button : A convenient reset button is provided to restore the supply to the load after non-essential loads are switched off. This feature allows for quick recovery and minimal disruption.; Protection Degree - IP20 : Designed with a protection degree of IP20, the ACCL offers solid protection against finger contact and small objects, ensuring safe and reliable operation within indoor environments.",
    "Benefits": "The ACCL automatically switches to the generator when the main power fails.; This ensures uninterrupted power.; It effectively manages and distributes generator power, minimizing downtime in high-rise apartments and commercial buildings.; When the main power returns, the ACCL seamlessly switches back.; This ensures continuous power flow without manual intervention.",
    "Image_Path": "/LK/lk_ea_products/images/Tripper.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/mcb-rccb-distribution-boards/modular-change-over/au",
    "Brand": "Lauritz Knudsen",
    "Type": "MCB, RCCB & DISTRIBUTION BOARDS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "AU",
    "Product_Type": "Modular Change Over",
    "Full_Description": "Since the start of our journey, we have listened, observed and experienced our customers' needs. AU Solutions is a range of protection, control and monitoring devices born from the learning gained. From protection against overload and earth leakage to lightning and switching surges, this range offers more than expected – meeting your needs of today and tomorrow.",
    "Short_Description": "Since the start of our journey, we have listened, observed and experienced our customers' needs. AU Solutions is a range of protection, control and monitoring devices born from the learning gained. From protection against overload and earth leakage to lightning and switching surges, this range offers more than expected – meeting your needs of today and tomorrow.",
    "Benefits": "If continuity of power is what you seek for your business, the AU Solutions range of manual Changeover Switches is the answer.; The Changeover Switches perfectly suit your applications, having a range of up to 63A.",
    "Image_Path": "/LK/lk_ea_products/images/AU.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/mcb-rccb-distribution-boards/isolators/tripper",
    "Brand": "Lauritz Knudsen",
    "Type": "MCB, RCCB & DISTRIBUTION BOARDS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Tripper",
    "Product_Type": "Isolators",
    "Full_Description": "Lauritz Knudsen Electrical and Automation is India's leading manufacturer of low-voltage and medium-voltage switchgear for industries, buildings, homes and agriculture segments. Since the start of our journey, we have listened, observed and experienced our customers' needs. Salient features of this range – Quick Break Mechanism, True Contact Position Indicator, Energy Limitation Class 3 – enhance safety of human lives and precious belongings. Further, Low Watt loss of these products reduces the amount of electricity consumed and results in low electricity expense.",
    "Short_Description": "The Tripper range isn't just about functionality; it's a testament to a philosophy that prioritizes peace of mind. It's about empowering homeowners to create a living space where they can thrive, knowing that every aspect of their environment has been carefully considered and fortified against potential risks.",
    "Image_Path": "/LK/lk_ea_products/images/Tripper.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/mcb-rccb-distribution-boards/distribution-board-db/exora-n",
    "Brand": "Lauritz Knudsen",
    "Type": "MCB, RCCB & DISTRIBUTION BOARDS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Exora.N",
    "Product_Type": "Distribution Board - Db",
    "Full_Description": "Add an appeal to your wall with the state-of-the-art Lauritz Knudsen Electrical & Automation’s New Range of distribution boards. The Distribution Boards are a perfect blend of superior aesthetics, contemporary feel and subtle presence that gel harmoniously with your décor Lauritz Knudsen Electrical & Automation's Distribution Board assortment is wide enough to take care of each and every customer requirement with its standard and customized offering",
    "Short_Description": "Add an appeal to your wall with the state-of-the-art E&A’s Range of distribution boards. The Distribution Boards are a perfect blend of superior aesthetics, contemporary feel and subtle presence that gel harmoniously with your décor Lauritz Knudsen Electrical & Automation's Distribution Board assortment is wide enough to take care of each and every customer requirement with its standard and customized offering",
    "Benefits": "Reversed Door at Site - DB Door can be adapted to site conditions; DB installation made convenient with independently removable door, shield, frame & chassis; Chassis can be stored separately - Product mounting and wiring made easy as the products can e conveniently mounted on the chassis & entire assembly can be easily fitted in the DB; Cement Spill protector - Protects DB interiors from cement splashes during civil activities.",
    "Image_Path": "/LK/lk_ea_products/images/Exora.N.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/pump-starters-and-controllers/controller/mu-gs-smart-controller",
    "Brand": "Lauritz Knudsen",
    "Type": "PUMP STARTERS & CONTROLLERS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "MU-GS SMART Controller",
    "Product_Type": "Controller",
    "Full_Description": "Since 1960, Lauritz Knudsen Electrical & Automation has been integral to Indian agriculture and industry, offering a range of low voltage motor protection solutions. These systems ensure reliable and efficient irrigation and water management, supporting the daily needs of farmers and businesses Designed and developed in-house, our starters and controllers are the preferred choice for efficiently managing pump operations, saving both energy and time for our customers Available for both three-phase and single-phase applications, LK controllers not only protect the motor but also enhance convenience and safety for the user Featuring a robust contactor, Single Phase Preventer, and Dual Voltmeter & Ammeter, this controller offers ease of installation, configuration, and maintenance. Seamlessly integrate it with communicable devices such as the M-POWER+ / M-POWER PRO / M-POWER++ modules for effortless remote pump operation Designed for up to 75 HP pumps in three-phase applications, our controllers efficiently operate agricultural motors and provide reliable protection. They offer overload protection, safeguard against phase unbalance, single phasing, and phase reversal failures, and include an auto-reset feature",
    "Short_Description": "The MU-G Smart Controller is a comprehensive solution designed to address the evolving needs of modern farming and water management. This all-in-one digital controller integrates various functionalities to enhance both convenience and efficiency in agricultural operations. It combines the traditional function of a controller with remote switching capabilities similar to M-POWER PRO, enabling effective and convenient control over your pumping systems from a distance. The Smart Controller is equipped with short circuit protection features similar to those found in MCBs, and dry run protection feature of i- Protector, ensuring your system operates safely under all conditions. An innovative anti-theft feature also protects the motor, cables, and controller against theft, securing your investment comprehensively. This multifaceted approach not only secures but simplifies the management of water systems, making farming operations more efficient and hassle-free.",
    "Key_Features": "In-built Anti-Theft Protection: Sends emergency alerts to your mobile if there is any attempt to steal your pump, cable, or controller, remaining active for 48 hours even without power.; Comprehensive Protection Mechanisms: Includes Dry Run, Locked Rotor, and Short Circuit protection with an integrated LTLK MCB.; Advanced Fault Protection: Features voltage and current-based protection for all faults with an option to enable or disable individual protections.; Sophisticated Timing Controls: Equipped with hour-based and Real-Time Clock-based timers, featuring time compensation to adjust for power interruptions.; Extensive Metering Capabilities: Provides detailed readings for Line Voltage, Phase Current, Power Factor, Power, Energy, and total runtime of your pump.; Remote Operation: Allows complete control (Remote ON/OFF, parameter setting, monitoring, and troubleshooting) via SMS, LTLK Connect Mobile App, or IVRS.; Multilingual Support: Available in multiple languages including Hindi, Gujarati, Marathi, Tamil, Telugu, Kannada, Malayalam, Bengali, Oriya, Punjabi, and English, allowing individual users to choose their preferred language.; Easy Installation: Comes with factory-fitted wiring and a terminal block; only requires connection to the supply and motor wires.",
    "Benefits": "The in-built anti-theft protection ensures security by alerting you via mobile about any unauthorized attempt to access your pump, cable, or controller, and remains functional for 48 hours without power.; Provides Dry Run, Locked Rotor, and Short Circuit protection to safeguard your equipment from potential damage, enhancing its longevity.; The controller's sophisticated timing controls include hour-based and Real-Time Clock-based timers with time compensation, ensuring accurate scheduling and efficiency even during power outages.; The cyclic timer can be set with timer compensation to recover lost operational time during power failures, ensuring continuous productivity.; Extensive metering capabilities provide detailed insights into Line Voltage, Phase Current, Power Factor, Power, Energy, and total run time of your pump, facilitating optimal resource management.; Remote operation capabilities allow for complete control via SMS, LTLK Connect Mobile App, or IVRS, offering convenience and accessibility.",
    "Image_Path": "/LK/lk_ea_products/images/MU-GS SMART Controller.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/pump-starters-and-controllers/pump-starter-and-controller-spare-accessories/m-power",
    "Brand": "Lauritz Knudsen",
    "Type": "PUMP STARTERS & CONTROLLERS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "M-POWER",
    "Product_Type": "Pump Starter And Controller Spare Accessories",
    "Full_Description": "Lauritz Knudsen Electrical & Automation is dedicated to providing top-tier accessories that enhance the functionality and efficiency of your systems. Our range includes innovative mobile modules designed for remote sensing, communication, and device control; specialised water level controllers and the Auto WLC K-Curve MCB, specifically tailored for agricultural pumps; power factor correction capacitors; and the SPPR- Sz5, SDz5, SASDz5 series. Additionally, our micro-controller-based i-Protector ensures effortless operation of pumps, integrating futuristic technology to streamline your operations. Committed to excellent customer service, Lauritz Knudsen guarantees the availability of spare parts for all our products and solutions. For detailed information on our spares and their specifications, please consult the provided price list. This ensures you have all the necessary details at your fingertips to maintain and enhance your equipment's performance efficiently.",
    "Short_Description": "M-POWER transforms the way you manage your pump systems by providing advanced remote operational capabilities. This innovative module is designed for use with a mobile starter, enabling users to effortlessly monitor and adjust key parameters such as voltage, current, motor run time, and motor status (On/Off) from anywhere, at any time, using their mobile phones. The intuitive interface allows for easy modification of settings including overvoltage (O/V), under-voltage (U/V), and dry run protection (DRP), enhancing the safety and efficiency of pump operations. Available in three distinct variants—M-POWER++, M-POWER+, and M-POWER Pro—each option is tailored to meet varying needs and preferences. Whether it's for agricultural, residential, commercial, or industrial use, the M-POWER series offers a scalable solution that not only simplifies management but also optimizes performance. These variants ensure that users can select a  mobile starter system that best fits their specific requirements, providing a versatile and reliable approach to pump management and protection.",
    "Key_Features": "M-POWER Pro Features:; Remote Access and Control: Operate your pump from anywhere at any time using SMS, IVRS, calls, and the Lauritz Knudsen Connect Android app for remote ON/OFF, parameter adjustments, monitoring, and troubleshooting.; Simple Installation: Features a 3-wire connection compatible with both Direct On Line (DOL) and Star Delta starters, ensuring easy setup.; Comprehensive Protection: Provides safeguards against phase loss, voltage imbalance, phase reversal, over-voltage, and under-voltage, along with a dry run fault; each protection mechanism can be individually enabled or disabled.; Versatile Compatibility: Compatible with three-phase DOL and Star Delta starters.; Advanced Timing Functions: Includes hour-based and network-based daily timers with four time slots and time compensation features.; Multi-User Control: Allows up to four users and one master to control the pump starter/controller via mobile phones.; Operational Flexibility: Offers auto, manual, and bypass modes and displays total run time information for your pump.; App Integration: Parameters like pump status (ON/OFF) and metering can be easily set and checked through the Lauritz Knudsen Connect App.; M-POWER++ / M-POWER+ Features:",
    "Benefits": "Remote Accessibility and Control: Users can operate their pump systems from any location at any time, ensuring full control over operations via a mobile app, which enhances flexibility and responsiveness to system needs.; Easy Installation and Versatile Use: The system's three-wire setup simplifies installation processes, and its compatibility with both DOL and Star Delta mobile starter makes it suitable for a wide range of applications, reducing setup time and complexity.; Comprehensive Safety Measures: M-Power Pro provides robust protection against electrical faults such as phase loss, voltage imbalances, and power surges, ensuring the longevity and reliability of pump operations.; Enhanced Operational Efficiency: Features like multi-user control, advanced timing functions, and operational flexibility via auto, manual, and bypass modes allow for precise management of run times and system monitoring, improving overall efficiency and productivity.; Communicative Interaction and Support: With support for multiple languages and the ability to receive real-time updates and notifications via SMS, users can stay informed about their system’s status and make timely decisions based on accurate operational data.; Preventive Maintenance and Protection: The inclusion of an hour meter helps in planning preventive maintenance, while adjustable ON delay timers offer added protection against mechanical stress caused by water hammer, extending the system's lifespan and ensuring continuous operation.",
    "Image_Path": "/LK/lk_ea_products/images/M-POWER.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/pump-starters-and-controllers/pump-starter-and-controller-spare-accessories/box-capacitors",
    "Brand": "Lauritz Knudsen",
    "Type": "PUMP STARTERS & CONTROLLERS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Box capacitors",
    "Product_Type": "Pump Starter And Controller Spare Accessories",
    "Full_Description": "Lauritz Knudsen Electrical & Automation is dedicated to providing top-tier accessories that enhance the functionality and efficiency of your systems. Our range includes innovative mobile modules designed for remote sensing, communication, and device control; specialised water level controllers and the Auto WLC K-Curve MCB, specifically tailored for agricultural pumps; power factor correction capacitors; and the SPPR- Sz5, SDz5, SASDz5 series. Additionally, our micro-controller-based i-Protector ensures effortless operation of pumps, integrating futuristic technology to streamline your operations. Committed to excellent customer service, Lauritz Knudsen guarantees the availability of spare parts for all our products and solutions. For detailed information on our spares and their specifications, please consult the provided price list. This ensures you have all the necessary details at your fingertips to maintain and enhance your equipment's performance efficiently.",
    "Short_Description": "Discover the efficiency and cost-saving potential of Box Capacitors, the premier choice for power factor correction (kVAr). Designed to optimise your electrical systems, these capacitors enable the use of thinner cables, significantly reducing your cabling costs. By improving the power factor, Box Capacitors ensure that your power distribution is more efficient, leading to lower energy consumption and operational expenses. But the benefits don't stop there. Box Capacitors are crucial in extending the lifespan of your motors. They help prevent overheating, a major cause of motor failure, by reducing thermal stress. This results in longer-lasting, more reliable motors, ensuring your operations run smoothly with minimal downtime. Invest in Box Capacitors today and experience superior performance and durability in your power management systems. Range : Available from 1kVAr to 30kVAr",
    "Key_Features": "Self-healing Property: Ensures the longer life of the capacitor.; Leak-Proof Construction: High viscous resin construction prevents leakage or spillage.; Superior Quality Materials: Made with Metalized Polypropylene (MPP) film, offering ingress-free construction and low losses for consistent capacitance value and extended lifespan.; Metal Construction: Allows natural cooling in ambient conditions.; High Voltage Compatibility : Suitable for operation under high voltage conditions.; Improved Power Factor & low losses: Optimized cable usage, reduced motor overheating, resulting in less damage and maintenance.",
    "Benefits": "Offer a longer lifespan, enhances reliability.; Superior quality materials ensure consistent performance and durability.; Metal construction allows for natural cooling, improving efficiency in ambient conditions.; These capacitors are suitable for high voltage applications, providing versatility.; Improved power factor ensures optimized cable usage and reduced motor overheating, leading to lesser damage and maintenance needs.",
    "Image_Path": "/LK/lk_ea_products/images/Box capacitors.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/pump-starters-and-controllers/pump-starter-and-controller-spare-accessories/cylindrical-capacitors",
    "Brand": "Lauritz Knudsen",
    "Type": "PUMP STARTERS & CONTROLLERS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Cylindrical Capacitors",
    "Product_Type": "Pump Starter And Controller Spare Accessories",
    "Full_Description": "Lauritz Knudsen Electrical & Automation is dedicated to providing top-tier accessories that enhance the functionality and efficiency of your systems. Our range includes innovative mobile modules designed for remote sensing, communication, and device control; specialised water level controllers and the Auto WLC K-Curve MCB, specifically tailored for agricultural pumps; power factor correction capacitors; and the SPPR- Sz5, SDz5, SASDz5 series. Additionally, our micro-controller-based i-Protector ensures effortless operation of pumps, integrating futuristic technology to streamline your operations. Committed to excellent customer service, Lauritz Knudsen guarantees the availability of spare parts for all our products and solutions. For detailed information on our spares and their specifications, please consult the provided price list. This ensures you have all the necessary details at your fingertips to maintain and enhance your equipment's performance efficiently.",
    "Short_Description": "Cylindrical capacitors are a cutting-edge solution for power factor correction (kVAr), designed to enhance the efficiency and reliability of your electrical systems. By improving the power factor, these capacitors enable the use of thinner cables, significantly reducing cabling costs and simplifying installation. This efficient power distribution not only lowers operational expenses but also optimises the overall performance of your system. Cylindrical capacitors also play a vital role in extending the lifespan of your motors by preventing overheating. By reducing thermal stress, these capacitors ensure that your motors run cooler and more efficiently, minimising the risk of damage and the need for frequent maintenance. Invest in cylindrical capacitors to achieve superior performance, cost savings, and long-term reliability for your electrical infrastructure. Range: Available from 1kVAr to 30kVAr",
    "Benefits": "Ensures longer lifespan, enhances reliability by preventing any spillage.; High-quality materials maintain consistent performance and durability over time.; Suitable for high voltage applications, offering greater versatility.; Improved power factor leads to optimized cable usage, reduced motor overheating, and lower maintenance requirements.",
    "Image_Path": "/LK/lk_ea_products/images/Cylindrical Capacitors.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/time-switches/crono",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Crono",
    "Product_Type": "Time Switches",
    "Full_Description": "Time Switches are used for fixed time daily / weekly applications. They are ideal for lighting applications and also used to control air-conditioners / coolers, geysers, conveyers, pumps and exhaust fans etc.",
    "Short_Description": "A Digital Time Switch is a programmable device that automates the switching of electrical circuits based on user-defined schedules. It offers precise control, multiple program settings, and an easy-to-read display, making it ideal for lighting, HVAC, and industrial systems requiring flexible timing.",
    "Image_Path": "/LK/lk_ea_products/images/Crono.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/timers/micon-175",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Micon 175",
    "Product_Type": "Timers",
    "Full_Description": "Timers are used to control processing times in a wide range of applications which includes star to delta changeover operations in Motor control / Starter panels, elevators, conveyor belt sequences, air conditioning systems, warning light systems etc.",
    "Short_Description": "The 17.5 mm Analog Timer is a compact mechanical device designed for basic time-based control of electrical loads. Its slim profile makes it ideal for space-constrained panels, offering reliable switching through a simple dial interface. Perfect for lighting, heating, and pump applications.",
    "Image_Path": "/LK/lk_ea_products/images/Micon 175.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/timers/digicon",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Digicon",
    "Product_Type": "Timers",
    "Full_Description": "Timers are used to control processing times in a wide range of applications which includes star to delta changeover operations in Motor control / Starter panels, elevators, conveyor belt sequences, air conditioning systems, warning light systems etc.",
    "Short_Description": "The Digital Timer offers precise and programmable control over electrical circuits with multiple on/off settings. Featuring an intuitive display and flexible scheduling options, it’s ideal for applications requiring accuracy, such as lighting systems, HVAC units, and industrial equipment.",
    "Image_Path": "/LK/lk_ea_products/images/Digicon.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/monitoring-devices/current-monitoring-relays",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Current Monitoring relays",
    "Product_Type": "Monitoring Devices",
    "Full_Description": "Monitoring devices ensure reliable detection of phase parameters such as phase loss, phase reverse, phase sequence and phase unbalance in all three-phase networks. They find application in HVAC, welding machines, elevators and cranes, etc.",
    "Short_Description": "A Current Monitoring Relay tracks the flow of current in electrical circuits to identify overloads, underloads, or phase imbalances. It ensures operational efficiency and protects motors, pumps, and other equipment from damage due to abnormal current conditions.",
    "Image_Path": "/LK/lk_ea_products/images/Current Monitoring relays.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/monitoring-devices/earth-leakage-relay",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Earth Leakage Relay",
    "Product_Type": "Monitoring Devices",
    "Full_Description": "Monitoring devices ensure reliable detection of phase parameters such as phase loss, phase reverse, phase sequence and phase unbalance in all three-phase networks. They find application in HVAC, welding machines, elevators and cranes, etc.",
    "Short_Description": "An Earth Leakage Relay detects leakage currents flowing to ground, indicating potential insulation failures or faults. It enhances electrical safety by providing early warnings or tripping circuits to prevent electric shocks, fire hazards, and equipment damage in residential, commercial, and industrial setups.",
    "Image_Path": "/LK/lk_ea_products/images/Earth Leakage Relay.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/push-buttons-indicating-lamps/push-button-plastic",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Push button plastic",
    "Product_Type": "Push Buttons Indicating Lamps",
    "Full_Description": "Remote control units play a crucial role on factory shop floor for operational safety and reliability. Reliable push buttons and indicators have been trusted by users across industries for over 4 decades.",
    "Short_Description": "Plastic Push Buttons offer a lightweight and cost-effective solution for control operations. Available in illuminated and non-illuminated variants, they are ideal for start/stop functions and signaling. Their ergonomic design ensures ease of use in various applications.",
    "Image_Path": "/LK/lk_ea_products/images/Push button plastic.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/rotary-switches/isolators-switches",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Isolators Switches",
    "Product_Type": "Rotary Switches",
    "Full_Description": "Lauritz Knudsen Electrical & Automation Rotary switch designed to make and break operation by rotating the knob in different position and it ensures reliable. This switch has a quick-make, quick-break mechanism with spring return functionality, and it ensures smooth and responsive operation. Rotary switches offer versatile mounting options including standard panel, flush, and single-hole configurations, along with enhanced safety features like door interlocking, padlock provision, and lock & key mechanisms.",
    "Short_Description": "Isolator switch is also called as ON-OFF Switch, and it designed to isolate electrical power from a specific area or equipment for safety and maintenance purposes. Isolator Switch comes in a wide range from 1 Pole to 12 Poles, Certain models include spring return mechanisms up to 4 poles for momentary energizing of circuits, while others feature pre-close contacts for enhanced safety especially in neutral and earth line connections. Isolators are generally rated for AC1/AC21 while for motor applications they need to be rated for AC3/ AC23 A duty.",
    "Image_Path": "/LK/lk_ea_products/images/Isolators Switches.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/rotary-switches/changeover-switches",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Changeover Switches",
    "Product_Type": "Rotary Switches",
    "Full_Description": "Lauritz Knudsen Electrical & Automation Rotary switch designed to make and break operation by rotating the knob in different position and it ensures reliable. This switch has a quick-make, quick-break mechanism with spring return functionality, and it ensures smooth and responsive operation. Rotary switches offer versatile mounting options including standard panel, flush, and single-hole configurations, along with enhanced safety features like door interlocking, padlock provision, and lock & key mechanisms.",
    "Short_Description": "Changeover Switches, also known as Double Throw Switches, are designed to operate between two distinct circuits. This switch is with or without OFF positions, offering flexibility in control and switching logic. These switches are ideal for applications requiring the selection between two different input/output sources, especially when the circuits operate at different voltages or are otherwise incompatible. Models without jumpers with potential-free contacts to allow safe and isolated switching between independent circuits.",
    "Image_Path": "/LK/lk_ea_products/images/Changeover Switches.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/rotary-switches/phase-changeover",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Phase Changeover",
    "Product_Type": "Rotary Switches",
    "Full_Description": "Lauritz Knudsen Electrical & Automation Rotary switch designed to make and break operation by rotating the knob in different position and it ensures reliable. This switch has a quick-make, quick-break mechanism with spring return functionality, and it ensures smooth and responsive operation. Rotary switches offer versatile mounting options including standard panel, flush, and single-hole configurations, along with enhanced safety features like door interlocking, padlock provision, and lock & key mechanisms.",
    "Short_Description": "A Phase Selector Switch is an electrical device used to select the most suitable phase from a multi-phase power supply typically three-phase to ensure uninterrupted power to single-phase loads. It is especially useful in areas with frequent phase failures or voltage fluctuations. It helps maintain consistent power supply by switching to the healthiest available phase, thereby protecting appliances and ensuring operational continuity.",
    "Image_Path": "/LK/lk_ea_products/images/Phase Changeover.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/rotary-switches/breaker-control-switch",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Breaker Control Switch",
    "Product_Type": "Rotary Switches",
    "Full_Description": "Lauritz Knudsen Electrical & Automation Rotary switch designed to make and break operation by rotating the knob in different position and it ensures reliable. This switch has a quick-make, quick-break mechanism with spring return functionality, and it ensures smooth and responsive operation. Rotary switches offer versatile mounting options including standard panel, flush, and single-hole configurations, along with enhanced safety features like door interlocking, padlock provision, and lock & key mechanisms.",
    "Short_Description": "A break control switch is known as a Trip-Neutral-Close switch or TNC switch. It is a three-position rotary control switch used primarily for the remote operation of circuit breakers. It provides manual control over the tripping and closing functions of a breaker by energizing the respective coils. When the switch is in close position it puts the circuit breaker in on position by energizing the closing coil and when switch is in trip position it will trip the circuit breaker by energizing the trip coil in circuit breaker these switch available with three mechanism:",
    "Image_Path": "/LK/lk_ea_products/images/Breaker Control Switch.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/rotary-switches/ammeter-selector-switch",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Not Found on Category Page",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Ammeter Selector Switch",
    "Product_Type": "Rotary Switches",
    "Full_Description": "Lauritz Knudsen Electrical & Automation Rotary switch designed to make and break operation by rotating the knob in different position and it ensures reliable. This switch has a quick-make, quick-break mechanism with spring return functionality, and it ensures smooth and responsive operation. Rotary switches offer versatile mounting options including standard panel, flush, and single-hole configurations, along with enhanced safety features like door interlocking, padlock provision, and lock & key mechanisms.",
    "Short_Description": "Instrumentation switches are designed to simplify electrical measurements by enabling the use of a single measuring instrument such as an ammeter or voltmeter across multiple circuits. These switch available with three distinct configurations to suit various measurements needs. Ammeter selector switch measures current across different circuits using a single ammeter and current transformer (CT), Voltmeter selector switch measures voltage between phases or between phase and neutral using a single voltmeter and combined Ammeter and voltmeter selector switch enables both current and voltage measurement using one ammeter, one voltmeter, and a single switch. These switches allow users to measure currents and voltages in different parts of a system without the need for multiple meters, making them ideal for compact and cost-effective panel designs.",
    "Image_Path": ""
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/rotary-switches/multistep-switch",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Multistep Switch",
    "Product_Type": "Rotary Switches",
    "Full_Description": "Lauritz Knudsen Electrical & Automation Rotary switch designed to make and break operation by rotating the knob in different position and it ensures reliable. This switch has a quick-make, quick-break mechanism with spring return functionality, and it ensures smooth and responsive operation. Rotary switches offer versatile mounting options including standard panel, flush, and single-hole configurations, along with enhanced safety features like door interlocking, padlock provision, and lock & key mechanisms.",
    "Short_Description": "Multistep switches, commonly referred as Pole-Way Switches, are designed to facilitate the connection of multiple circuits to a common supply or vice versa. These switches are provided with or without OFF positions, offering operational flexibility.",
    "Image_Path": "/LK/lk_ea_products/images/Multistep Switch.jpg"
  },
  {
    "Product_URL": "https://www.lk-ea.com/products/industrial-signalling-products/rotary-switches/loadbreak-switches",
    "Brand": "Lauritz Knudsen",
    "Type": "INDUSTRIAL SIGNALLING PRODUCTS",
    "Image_Download_Status": "Downloaded",
    "Brochure_Download_Status": "Not Downloaded",
    "Downloaded_Documents": [],
    "Name": "Loadbreak Switches",
    "Product_Type": "Rotary Switches",
    "Full_Description": "Lauritz Knudsen Electrical & Automation Rotary switch designed to make and break operation by rotating the knob in different position and it ensures reliable. This switch has a quick-make, quick-break mechanism with spring return functionality, and it ensures smooth and responsive operation. Rotary switches offer versatile mounting options including standard panel, flush, and single-hole configurations, along with enhanced safety features like door interlocking, padlock provision, and lock & key mechanisms.",
    "Short_Description": "Loadbreak switches has Double break contracts with polycarbonate shroud for wired terminal protection is included with excellent switching and high short circuit capacity. With outstanding electrical characteristics of loadbreak switches with compact design, it also contributes to space saving installation and operational convenience.",
    "Image_Path": "/LK/lk_ea_products/images/Loadbreak Switches.jpg"
  }
]